NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
/*
 * This confidential and proprietary software may be used only as
 * authorised by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2011-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */


#include <shared/m200_texture.h>
#include <shared/mali_convert.h>
#include <shared/mali_surface.h>
#include <base/mali_byteorder.h>

/* Remap table for linear to block interleaved */
const u8 mali_convert_block_interleave_lut[] = {
	0x00, 0x01, 0x04, 0x05, 0x10, 0x11, 0x14, 0x15, 0x40, 0x41, 0x44, 0x45, 0x50, 0x51, 0x54, 0x55,
	0x03, 0x02, 0x07, 0x06, 0x13, 0x12, 0x17, 0x16, 0x43, 0x42, 0x47, 0x46, 0x53, 0x52, 0x57, 0x56,
	0x0c, 0x0d, 0x08, 0x09, 0x1c, 0x1d, 0x18, 0x19, 0x4c, 0x4d, 0x48, 0x49, 0x5c, 0x5d, 0x58, 0x59,
	0x0f, 0x0e, 0x0b, 0x0a, 0x1f, 0x1e, 0x1b, 0x1a, 0x4f, 0x4e, 0x4b, 0x4a, 0x5f, 0x5e, 0x5b, 0x5a,
	0x30, 0x31, 0x34, 0x35, 0x20, 0x21, 0x24, 0x25, 0x70, 0x71, 0x74, 0x75, 0x60, 0x61, 0x64, 0x65,
	0x33, 0x32, 0x37, 0x36, 0x23, 0x22, 0x27, 0x26, 0x73, 0x72, 0x77, 0x76, 0x63, 0x62, 0x67, 0x66,
	0x3c, 0x3d, 0x38, 0x39, 0x2c, 0x2d, 0x28, 0x29, 0x7c, 0x7d, 0x78, 0x79, 0x6c, 0x6d, 0x68, 0x69,
	0x3f, 0x3e, 0x3b, 0x3a, 0x2f, 0x2e, 0x2b, 0x2a, 0x7f, 0x7e, 0x7b, 0x7a, 0x6f, 0x6e, 0x6b, 0x6a,
	0xc0, 0xc1, 0xc4, 0xc5, 0xd0, 0xd1, 0xd4, 0xd5, 0x80, 0x81, 0x84, 0x85, 0x90, 0x91, 0x94, 0x95,
	0xc3, 0xc2, 0xc7, 0xc6, 0xd3, 0xd2, 0xd7, 0xd6, 0x83, 0x82, 0x87, 0x86, 0x93, 0x92, 0x97, 0x96,
	0xcc, 0xcd, 0xc8, 0xc9, 0xdc, 0xdd, 0xd8, 0xd9, 0x8c, 0x8d, 0x88, 0x89, 0x9c, 0x9d, 0x98, 0x99,
	0xcf, 0xce, 0xcb, 0xca, 0xdf, 0xde, 0xdb, 0xda, 0x8f, 0x8e, 0x8b, 0x8a, 0x9f, 0x9e, 0x9b, 0x9a,
	0xf0, 0xf1, 0xf4, 0xf5, 0xe0, 0xe1, 0xe4, 0xe5, 0xb0, 0xb1, 0xb4, 0xb5, 0xa0, 0xa1, 0xa4, 0xa5,
	0xf3, 0xf2, 0xf7, 0xf6, 0xe3, 0xe2, 0xe7, 0xe6, 0xb3, 0xb2, 0xb7, 0xb6, 0xa3, 0xa2, 0xa7, 0xa6,
	0xfc, 0xfd, 0xf8, 0xf9, 0xec, 0xed, 0xe8, 0xe9, 0xbc, 0xbd, 0xb8, 0xb9, 0xac, 0xad, 0xa8, 0xa9,
	0xff, 0xfe, 0xfb, 0xfa, 0xef, 0xee, 0xeb, 0xea, 0xbf, 0xbe, 0xbb, 0xba, 0xaf, 0xae, 0xab, 0xaa,
};

/* lRGB to sRGB LUT */
const u8 mali_convert_linear_to_nonlinear_lut[256] =
{
	0, 13, 22, 28, 33, 38, 42, 46, 49, 53, 56, 58, 61, 64, 66, 68, 71,
	73, 75, 77, 79, 81, 83, 85, 86, 88, 90, 91, 93, 95, 96, 98, 99,
	101, 102, 103, 105, 106, 108, 109, 110, 112, 113, 114, 115, 116, 118, 119, 120,
	121, 122, 123, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137,
	138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 147, 148, 149, 150, 151, 152,
	153, 154, 154, 155, 156, 157, 158, 159, 159, 160, 161, 162, 163, 163, 164, 165,
	166, 167, 167, 168, 169, 170, 170, 171, 172, 173, 173, 174, 175, 175, 176, 177,
	178, 178, 179, 180, 180, 181, 182, 182, 183, 184, 184, 185, 186, 186, 187, 188,
	188, 189, 190, 190, 191, 192, 192, 193, 194, 194, 195, 195, 196, 197, 197, 198,
	199, 199, 200, 200, 201, 202, 202, 203, 203, 204, 205, 205, 206, 206, 207, 207,
	208, 209, 209, 210, 210, 211, 211, 212, 213, 213, 214, 214, 215, 215, 216, 216,
	217, 218, 218, 219, 219, 220, 220, 221, 221, 222, 222, 223, 223, 224, 224, 225,
	226, 226, 227, 227, 228, 228, 229, 229, 230, 230, 231, 231, 232, 232, 233, 233,
	234, 234, 235, 235, 236, 236, 237, 237, 237, 238, 238, 239, 239, 240, 240, 241,
	241, 242, 242, 243, 243, 244, 244, 245, 245, 246, 246, 246, 247, 247, 248, 248,
	249, 249, 250, 250, 251, 251, 251, 252, 252, 253, 253, 254, 254, 255, 255
};

/* sRGB to lRGB LUT */
const u8 mali_convert_nonlinear_to_linear_lut[256] =
{
	0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
	1, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4,
	4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 7, 7, 7, 8,
	8, 8, 8, 9, 9, 9, 10, 10, 10, 11, 11, 12, 12, 12, 13, 13,
	14, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 18, 19, 19, 20, 21,
	21, 22, 22, 23, 23, 24, 24, 25, 26, 26, 27, 27, 28, 29, 29, 30,
	31, 31, 32, 33, 33, 34, 35, 35, 36, 37, 38, 38, 39, 40, 41, 41,
	42, 43, 44, 45, 45, 46, 47, 48, 49, 50, 51, 51, 52, 53, 54, 55,
	56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
	72, 73, 74, 76, 77, 78, 79, 80, 81, 82, 84, 85, 86, 87, 88, 90,
	91, 92, 93, 95, 96, 97, 99, 100, 101, 103, 104, 105, 107, 108, 109, 111,
	112, 114, 115, 116, 118, 119, 121, 122, 124, 125, 127, 128, 130, 131, 133, 134,
	136, 138, 139, 141, 142, 144, 146, 147, 149, 151, 152, 154, 156, 157, 159, 161,
	163, 164, 166, 168, 170, 172, 173, 175, 177, 179, 181, 183, 184, 186, 188, 190,
	192, 194, 196, 198, 200, 202, 204, 206, 208, 210, 212, 214, 216, 218, 220, 222,
	224, 226, 229, 231, 233, 235, 237, 239, 242, 244, 246, 248, 250, 253, 255
};

#if !defined(__SYMBIAN32__) || defined(SYMBIAN_LIB_MALI_BASE)

/**
 * Helper function for 16 bit linear to block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex16_l_to_tex16_b_partial(
	u8*                    dst,
	const u8               *src,
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned )
{
	u32       u, v, dx, dy;
	const u8  *src_row = src + conv_rect->sx*2 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			*((u16*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = ((u16*)src_row)[u];
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

/**
 * Helper function for 16 bit linear to block interleaved conversion. 
 * Full width specialization, i.e. 16 texels wide.
 * @param dst
 * @param src
 * @param width - Unaligned texture width
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex16_l_to_tex16_b_full_width(
	u8*         dst,
	const u8    *src,
	u32          height,
	s32          src_pitch )
{
	u32      u, v;
	const u8 *remap        = mali_convert_block_interleave_lut;

	for( v=height; v>0; v-- )
	{
		const u16 *src16 = (u16*)src;
		u16 *dst16 = (u16*)dst;

		for( u=0; u<4; u++ )
		{
			u8 index0 = *remap++;
			u8 index1 = *remap++;
			u8 index2 = *remap++;
			u8 index3 = *remap++;

			dst16[index0] = *src16++;
			dst16[index1] = *src16++;
			dst16[index2] = *src16++;
			dst16[index3] = *src16++;
		}
		src += src_pitch;
	}
}

/**
 * Helper function for 32 bit linear to 16 bit block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex32_l_to_tex16_b_partial(
	u8*                    dst,
	const u8               *src, 
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned )
{
	u32       u, v, dx, dy;
	const u8  *src_row = (u8*)src + conv_rect->sx*4 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		const u32* src_pos = (const u32*) src_row;
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			u32 tmp = (*src_pos)>>16;
			*((u16*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = tmp;
			src_pos++;
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}


#define TEX_8_24_TO_TEX_24_8( a )  ((a & 0xFFFFFF00) >> 8) | ((a & 0xFF) << 24)
/**
 * Helper function for 8_24 bit linear to 24_8 bit block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex8_24_l_to_tex24_8_b_partial(
	u8*                    dst,
	const u8               *src, 
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned )
{
	u32       u, v, dx, dy;
	const u8  *src_row = (u8*)src + conv_rect->sx*4 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		const u32* src_pos = (const u32*) src_row;
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			u32 tmp = TEX_8_24_TO_TEX_24_8(*src_pos);
			*((u32*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = tmp;
			src_pos++;
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

#undef TEX_8_24_TO_TEX_24_8

void _mali_convert_tex32_l_to_tex16_b(
	u8*          dst,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch )
{
#if 0
	s32 x, y;
	u32 xfull, block, xover, width_aligned;

	/* Calculate the number of full width / height blocks. */
	width_aligned = MALI_ALIGN( width, 16 );
	xfull = (width >> 4) << 4;
	xover = width - xfull;
	block = 0;

	/* Do full block interleaving if available. Partial horizontal interleaving 
	 * is done on outer remaining rectangles */
	for( y=0; y<height; y+=16 )
	{
		u32 yblock = height - y;
		if( yblock > 16 )
		{
			yblock = 16;
		}

