NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
		for( x=0; x<xfull; x+=16 )
		{
			_tex32_l_to_tex16_b_full_width(
				&dst[block * 16 * 16 * 2],
				&src[(x*4) + (y * src_pitch)],
				yblock,
				src_pitch );
			block++;
		}

		if( xover ) block++;
	}

	if( xover )
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = xfull;
		conv_rect.sy = 0;
		conv_rect.dx = xfull;
		conv_rect.dy = 0;
		conv_rect.width = xover;
		conv_rect.height = height;

		_tex32_l_to_tex16_b_partial(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned );
	}
#endif

	mali_convert_rectangle conv_rect;
	u32 width_aligned = MALI_ALIGN( width, 16 );
	conv_rect.sx = 0;
	conv_rect.sy = 0;
	conv_rect.dx = 0;
	conv_rect.dy = 0;
	conv_rect.width = width;
	conv_rect.height = height;

	_tex32_l_to_tex16_b_partial(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned );
}

void _mali_convert_tex8_24_l_to_tex24_8_b(
	u8*          dst,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch )
{
	mali_convert_rectangle conv_rect;
	u32 width_aligned = MALI_ALIGN( width, 16 );
	conv_rect.sx = 0;
	conv_rect.sy = 0;
	conv_rect.dx = 0;
	conv_rect.dy = 0;
	conv_rect.width = width;
	conv_rect.height = height;

	_tex8_24_l_to_tex24_8_b_partial(
		dst,
		src,
		&conv_rect,
		src_pitch,
		width_aligned );
}

void _mali_convert_tex16_l_to_tex16_b(
	u8*          dst,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch )
{
	u32 x, y;
	u32 xfull, block, xover, width_aligned;

	/* Calculate the number of full width / height blocks. */
	width_aligned = MALI_ALIGN( width, 16 );
	xfull = (width >> 4) << 4;
	block = 0;
	xover = width - xfull;

	/* Do full block interleaving if available. Partial horizontal interleaving 
	 * is done on outer remaining rectangles */
#if MALI_TEX16_L_TO_TEX16_B_FULL_BLOCK_DEFINED
	{
		u32 yfull, yover;

		yfull = (height >> 4) << 4;
		yover = height - yfull;

		for( y=0; y<yfull; y+=16 )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_mali_osu_tex16_l_to_tex16_b_full_block(
					&dst[block * 16 * 16 * 2],
					&src[(x*2) + (y * src_pitch)],
					src_pitch );
				block++;
			}
			if( xover ) block++;
		}
		if( yover )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_tex16_l_to_tex16_b_full_width(
					&dst[block * 16 * 16 * 2],
					&src[(x*2) + (y * src_pitch)],
					yover,
					src_pitch );
				block++;
			}
		}
	}
#else
	for( y=0; y<height; y+=16 )
	{
		u32 yblock = height - y;
		if( yblock > 16 )
		{
			yblock = 16;
		}

		for( x=0; x<xfull; x+=16 )
		{
			_tex16_l_to_tex16_b_full_width(
				&dst[block * 16 * 16 * 2],
				&src[(x*2) + (y * src_pitch)],
				yblock,
				src_pitch );
			block++;
		}
		if( xover ) block++;
	}
#endif
	if( xover )
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = xfull;
		conv_rect.sy = 0;
		conv_rect.dx = xfull;
		conv_rect.dy = 0;
		conv_rect.width = xover;
		conv_rect.height = height;

		_tex16_l_to_tex16_b_partial(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned );
	}
}

/**
 * TODO: Remove these special cases.
 * The special cases added when OLD_SPECIAL_CASES is set to 1 are not necessary for the correctness
 * of the code, they only speed it up somewhat. The results can be seen in gles2_performance_suite and
 * shared_main_suite.
 * The cases consist of about 1500 lines of code, and should be removed if the performance without them is
 * increased or deemed acceptable.
 */
#define OLD_SPECIAL_CASES 1
#if OLD_SPECIAL_CASES

/**
 * Helper function for 24 bit linear to block interleaved conversion. 
 * Handles any sub-region
 * @param dst
 * @param src
 * @param width - Unaligned texture width
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex24_l_to_tex24_b_partial(
	u8                           *dst,
	const u8                     *src,
	const mali_convert_rectangle *conv_rect,
	s32                          src_pitch,
	u32                          width_aligned )
{
	u32      u, v, dx, dy;
	const u8  *src_row = src + conv_rect->sx*3 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v = 0; v < conv_rect->height; v++ )
	{
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			u8 *dst_blocked = (u8*)((u32)dst + (3*MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned )));

			dst_blocked[0] = src_row[u*3+0];
			dst_blocked[1] = src_row[u*3+1];
			dst_blocked[2] = src_row[u*3+2];
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

/**
 * Helper function for 24 bit linear to block interleaved conversion. 
 * Full width specialization, i.e. 16 texels wide.
 * @param dst
 * @param src
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex24_l_to_tex24_b_full_width(
	u8*          dst,
	const u8     *src,
	u32          height,
	s32          src_pitch )
{
	u32      u, v;
	const u8 *remap        = mali_convert_block_interleave_lut;

	for( v=height; v>0; v-- )
	{
		u8 *src8 = (u8*)src;
		for( u=0; u<4; u++ )
		{
			u32 index0 = ((u32)(*remap++)) * 3;
			u32 index1 = ((u32)(*remap++)) * 3;
			u32 index2 = ((u32)(*remap++)) * 3;
			u32 index3 = ((u32)(*remap++)) * 3;

			dst[index0+0] = *src8++;
			dst[index0+1] = *src8++;
			dst[index0+2] = *src8++;

			dst[index1+0] = *src8++;
			dst[index1+1] = *src8++;
			dst[index1+2] = *src8++;

			dst[index2+0] = *src8++;
			dst[index2+1] = *src8++;
			dst[index2+2] = *src8++;

			dst[index3+0] = *src8++;
			dst[index3+1] = *src8++;
			dst[index3+2] = *src8++;
		}
		src += src_pitch;
	}
}

/**
 * Helper function for 8 bit linear to block interleaved conversion. 
 * Full width specialization, i.e. 16 texels wide.
 * @param dst
 * @param src
 * @param width - Unaligned texture width
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex8_l_to_tex8_b_full_width(
	u8*         dst,
	const u8    *src,
	u32          height,
	s32          src_pitch )
{
	u32      u, v;
	const u8 *remap        = mali_convert_block_interleave_lut;

	for( v=height; v>0; v-- )
	{
		const u8 *src8 = src;
		for( u=16; u>0; u-=4 )
		{
			u8 index0 = *remap++;
			u8 index1 = *remap++;
			u8 index2 = *remap++;
			u8 index3 = *remap++;

			dst[index0] = *src8++;
			dst[index1] = *src8++;
			dst[index2] = *src8++;
			dst[index3] = *src8++;
		}
		src += src_pitch;
	}
}

/**
 * Helper function for 8 bit linear to block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex8_l_to_tex8_b_partial(
	u8*                    dst,
	const u8               *src,
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned )
{
	u32       u, v, dx, dy;
	const u8  *src_row = src + conv_rect->sx + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			*(dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = src_row[u];
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

