NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
#define SWAP_32_NO_ORDER( tmp )	tmp = ( ( ( tmp >> 16) | (tmp << 16) ) & mask ) | ( tmp & ~mask );

/**
 * Helper function for 32 bit linear to block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex32_l_to_tex32_b_partial_swap(
	u8*                    dst,
	const u8               *src, 
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned,
	u32						mask_in )
{
	u32       u, v, dx, dy;
	const u8  *src_row = (u8*)src + conv_rect->sx*4 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		const u32 mask = mask_in;
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			u32 tmp = ((u32*)src_row)[u];
			SWAP_32_NO_ORDER(tmp)
			*((u32*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = tmp;
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

/**
 * Helper function for 32 bit linear to block interleaved conversion. 
 * Handles block interleaving for any sub-area.
 * @param dst
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 */
static void _tex32_l_to_tex32_b_partial(
	u8*                    dst,
	const u8               *src, 
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned )
{
	u32       u, v, dx, dy;
	const u8  *src_row = (u8*)src + conv_rect->sx*4 + conv_rect->sy*src_pitch;

	dy = conv_rect->dy;
	for( v =  0; v < conv_rect->height; v++ )
	{
		dx = conv_rect->dx;
		for( u = 0; u < conv_rect->width; u++ )
		{
			*((u32*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = ((u32*)src_row)[u];
			dx++;
		}
		src_row += src_pitch;
		dy++;
	}
}

/**
 * Helper function for 32 bit linear to block interleaved conversion which
 * forces alpha to one.
 * @note Handles block interleaving for any sub-area.
 * @param dst
 * @param dst_nonpre - Stores normalized data. Will be ignored if NULL.
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch - Source pitch
 * @param width_aligned - Block aligned width of destination
 * @param rev_order - rgbx if MALI_TRUE, xbgr if not
 */
static void _tex32_l_to_tex32_b_alpha_to_one_partial(
	u8*                    dst,
	u8*                    dst_nonpre,
	const u8               *src, 
	mali_convert_rectangle *conv_rect,
	s32                    src_pitch,
	u32                    width_aligned,
	mali_bool              rev_order )
{
	u32       u, v, dx, dy;
	u32       alpha_mask = rev_order ? 0xFF : 0xFF000000;
	const u8  *src_row = (u8*)src + conv_rect->sx*4 + conv_rect->sy*src_pitch;

	if ( NULL != dst_nonpre )
	{
		dy = conv_rect->dy;
		for( v =  0; v < conv_rect->height; v++ )
		{
			dx = conv_rect->dx;
			for( u = 0; u < conv_rect->width; u++ )
			{
				u32 offset = MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned );
				u32* dst32 = ((u32*)dst + offset);
				u32* dst32_nonpre = ((u32*)dst_nonpre + offset);
				*dst32 = (((u32*)src_row)[u]|alpha_mask);
				*dst32_nonpre = *dst32;
				dx++;
			}
			src_row += src_pitch;
			dy++;
		}
	}
	else
	{
		dy = conv_rect->dy;
		for( v =  0; v < conv_rect->height; v++ )
		{
			dx = conv_rect->dx;
			for( u = 0; u < conv_rect->width; u++ )
			{
				*((u32*)dst + MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned ) ) = (((u32*)src_row)[u]|alpha_mask);
				dx++;
			}
			src_row += src_pitch;
			dy++;
		}
	}
}

/**
 * Helper function for 32 bit linear to block interleaved conversion. 
 * Full width specialized, i.e. 16 texels wide.
 * @param dst
 * @param src
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex32_l_to_tex32_b_full_width(
	u8*          dst,
	const u8     *src,
	u32          height,
	s32          src_pitch )
{
	u32      u, v;
	const u8 *remap        = mali_convert_block_interleave_lut;

	for( v=height; v>=1; v-- )
	{
		const u32 *src32 = (u32*)src;
		u32 *dst32 = (u32*)dst;
		for( u=0; u<4; u++ )
		{
			u32 index0 = *remap++;
			u32 index1 = *remap++;
			u32 index2 = *remap++;
			u32 index3 = *remap++;

			dst32[index0] = *src32++;
			dst32[index1] = *src32++;
			dst32[index2] = *src32++;
			dst32[index3] = *src32++;
		}
		src += src_pitch;
	}
}

/**
 * Helper function for 32 bit linear to block interleaved conversion with swap. 
 * Full width specialized, i.e. 16 texels wide.
 * @param dst
 * @param src
 * @param height - Unaligned texture height
 * @param src_pitch - Source pitch
 */
static void _tex32_l_to_tex32_b_full_width_swap(
	u8*          dst,
	const u8     *src,
	u32          height,
	s32          src_pitch,
	u32          mask_in )
{
	u32      u, v;
	const u8 *remap        = mali_convert_block_interleave_lut;

	for( v=height; v>=1; v-- )
	{
		const u32 mask = mask_in;
		const u32 *src32 = (u32*)src;
		u32 *dst32 = (u32*)dst;
		for( u=0; u<4; u++ )
		{
			u32 tmp0 = *src32++;
			u32 tmp1 = *src32++;
			u32 tmp2 = *src32++;
			u32 tmp3 = *src32++;

			u32 index0 = *remap++;
			u32 index1 = *remap++;
			u32 index2 = *remap++;
			u32 index3 = *remap++;

			SWAP_32_NO_ORDER(tmp0)
			SWAP_32_NO_ORDER(tmp1)
			SWAP_32_NO_ORDER(tmp2)
			SWAP_32_NO_ORDER(tmp3)

			dst32[index0] = tmp0;
			dst32[index1] = tmp1;
			dst32[index2] = tmp2;
			dst32[index3] = tmp3;
		}
		src += src_pitch;
	}
}

/**
 * Helper function for 32 bit linear to block interleaved conversion 
 * with premult and non-premult storage.
 * @param dst_premult - Destination to be interleaved and premultiplied with alpha
 * @param dst_nonpre - Destination to be interleaved. No premultiplication.
 * @param src
 * @param conv_rect - Src and dst conversion rectangle 
 * @param src_pitch 
 * @param rev_order - Specifies if reverse alpha or not,i.e [RGBA] vs [ARGB]
 * @param width_aligned - Block aligned width
 *
 */
static void _tex32_l_to_tex32_b_partial_premult(
	u8                           *dst_premult,
	u8                           *dst_nonpre,
	const u8                     *src,
	const mali_convert_rectangle *conv_rect,
	u32                          src_pitch,
	u32                          width_aligned,
	mali_bool                    rev_order )
{
#define UNPACK_TEXEL( t, r,g,b,a ) \
	do { \
		(r) = ( (t) >> 24 ) & 0xFF; \
		(g) = ( (t) >> 16 ) & 0xFF; \
		(b) = ( (t) >> 8 ) & 0xFF; \
		(a) = ( (t) ) & 0xFF; \
	} while( 0 )

