NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
	u32 i,j;
	u32 dx,dy;
	u8 *src_row;

	MALI_DEBUG_ASSERT_POINTER( src );
	MALI_DEBUG_ASSERT_POINTER( dst_premult );
	MALI_DEBUG_ASSERT_POINTER( dst_nonpre );
	MALI_DEBUG_ASSERT_POINTER( conv_rect );

	src_row = ( u8 * )src + conv_rect->sy * src_pitch + conv_rect->sx * 4;
	dy = conv_rect->dy;

	if ( MALI_TRUE == rev_order )
	{
		for ( j = 0; j < conv_rect->height; j++ )
		{
			dx = conv_rect->dx;
			for ( i = 0; i < conv_rect->width; i++ )
			{
				u32 texel = ( ( u32 * ) src_row )[i];
				u32 c1;
				u32 c2;
				u32 c3;
				u32 a;
				u32 pre_texel;
				u32 dest_address;

				UNPACK_TEXEL( texel, c1,c2,c3,a );
				c1 = _mali_convert_to_premult ( c1, a );
				c2 = _mali_convert_to_premult ( c2, a );
				c3 = _mali_convert_to_premult ( c3, a );
				pre_texel = _mali_convert_pack_8888( c1, c2, c3, a );

				dest_address = MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned );
				*( ( u32 * ) dst_premult + dest_address ) = pre_texel;
				*( ( u32 * ) dst_nonpre + dest_address ) = texel;
				dx++;
			}
			dy++;
			src_row += src_pitch;
		}
	}
	else
	{
		for ( j = 0; j < conv_rect->height; j++ )
		{
			dx = conv_rect->dx;
			for ( i = 0; i < conv_rect->width; i++ )
			{
				u32 texel = ( ( u32 * ) src_row )[i];
				u32 c1;
				u32 c2;
				u32 c3;
				u32 a;
				u32 pre_texel;
				u32 dest_address;

				UNPACK_TEXEL( texel, a, c3,c2,c1 );
				c1 = _mali_convert_to_premult ( c1, a );
				c2 = _mali_convert_to_premult ( c2, a );
				c3 = _mali_convert_to_premult ( c3, a );
				pre_texel = _mali_convert_pack_8888( a, c3, c2, c1 );

				dest_address = MALI_CONVERT_BLOCKED_ADDRESS ( dx, dy, width_aligned );
				*( ( u32 * ) dst_premult + dest_address ) = pre_texel;
				*( ( u32 * ) dst_nonpre + dest_address ) = texel;
				dx++;
			}
			dy++;
			src_row += src_pitch;
		}
	}

#undef UNPACK_TEXEL
}

void _mali_convert_tex32_l_to_tex32_b_premult(
	u8*          dst_pre,
	u8*          dst_nonpre,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch,
	mali_bool    rev_order )
{
	u32      width_aligned;

	width_aligned = MALI_ALIGN( width, 16 );

#if MALI_TEX32_L_TO_TEX32_B_FULL_BLOCK_PREMULT_REVERSE_DEFINED
	{
		u32 x, y;
		u32 xfull, block, yfull, xover, yover;

		/* Calculate the number of full width / height blocks. */
		xfull = (width >> 4) << 4;
		yfull = (height >> 4) << 4;
		xover = width - xfull;
		yover = height - yfull;
		block = 0;

		/* First use optimized full block swizzling. Then do partial 
		 * swizzling on the two outer rectangles. */
		if ( MALI_TRUE == rev_order )
		{
			for( y=0; y<yfull; y+=16 )
			{
				for( x=0; x<xfull; x+=16 )
				{
					const u8* src_ptr = src + (x*4) + (y * src_pitch);
					_mali_osu_tex32_l_to_tex32_b_full_block_premult_reverse(
						&dst_pre[block * 16 * 16 * 4],
						&dst_nonpre[block * 16 * 16 * 4 ],
						src_ptr,
						src_pitch );
					block++;
				}

				/* Need to index outer horizontal block */
				if( xover ) block++;
			}
		}
		else
		{
			for( y=0; y<yfull; y+=16 )
			{
				for( x=0; x<xfull; x+=16 )
				{
					_mali_osu_tex32_l_to_tex32_b_full_block_premult(
						&dst_pre[block * 16 * 16 * 4],
						&dst_nonpre[block * 16 * 16 * 4 ],
						&src[(x*4) + (y * src_pitch)],
						src_pitch );
					block++;
				}

				/* Need to index outer horizontal block */
				if( xover ) block++;
			}
		}
		if( yover )
		{
			mali_convert_rectangle conv_rect;
			conv_rect.sx = 0;
			conv_rect.sy = yfull;
			conv_rect.dx = 0;
			conv_rect.dy = yfull;
			conv_rect.width = width;
			conv_rect.height = yover;

			_tex32_l_to_tex32_b_partial_premult(
				dst_pre,
				dst_nonpre,
				src,
				&conv_rect,
				src_pitch,
				width_aligned,
				rev_order );
		}
		if( xover )
		{
			mali_convert_rectangle conv_rect;
			conv_rect.sx = xfull;
			conv_rect.sy = 0;
			conv_rect.dx = xfull;
			conv_rect.dy = 0;
			conv_rect.width = xover;
			conv_rect.height = yfull;

			_tex32_l_to_tex32_b_partial_premult(
				dst_pre,
				dst_nonpre,
				src,
				&conv_rect,
				src_pitch,
				width_aligned,
				rev_order );
		}
	}
#else
	{
		/* No full block premult implementation available. 
		 * Use sw-fallback on whole area */
		mali_convert_rectangle conv_rect;
		conv_rect.sx = 0;
		conv_rect.sy = 0;
		conv_rect.dx = 0;
		conv_rect.dy = 0;
		conv_rect.width = width;
		conv_rect.height = height;

		_tex32_l_to_tex32_b_partial_premult(
			dst_pre,
			dst_nonpre,
			src,
			&conv_rect,
			src_pitch,
			width_aligned,
			rev_order );
	}
#endif
}

void _mali_convert_tex32_l_to_tex32_b_alpha_to_one(
	u8*               dst,
	u8*               dst_nonpre,
	const u8*         src,
	u32               width,
	u32               height,
	s32               src_pitch,
	mali_bool         rev_order )
{
	/* Calculate the number of full width / height blocks. */
	u32 width_aligned = MALI_ALIGN( width, 16 );

#if MALI_TEX32_L_TO_TEX32_B_XBGR_FULL_BLOCK_DEFINED
	/* Do full block interleaving if available. Partial interleaving 
	 * done on outer remaining rectangles */
	{
		u32 x, y;
		u32 xfull, block, xover;
		u32 yfull, yover;
		yfull = (height >> 4) << 4;
		yover = height - yfull;
		xfull = (width >> 4) << 4;
		xover = width - xfull;
		block = 0;

		for( y=0; y<yfull; y+=16 )
		{
			for( x=0; x<xfull; x+=16 )
			{
				const u8* src_ptr = src + (x*4) + (y * src_pitch);
				if ( NULL != dst_nonpre )
				{
					if ( MALI_TRUE == rev_order )
					{
						_mali_osu_tex32_l_to_tex32_b_rgbx_premult_full_block(
							&dst[block * 16 * 16 * 4],
							src_ptr,
							src_pitch,
							&dst_nonpre[block * 16 * 16 * 4] );
					}
					else
					{
						_mali_osu_tex32_l_to_tex32_b_xbgr_premult_full_block(
							&dst[block * 16 * 16 * 4],
							src_ptr,
							src_pitch,
							&dst_nonpre[block * 16 * 16 * 4] );
					}
				}
				else
				{
					if ( MALI_TRUE == rev_order )
					{
						_mali_osu_tex32_l_to_tex32_b_rgbx_full_block(
							&dst[block * 16 * 16 * 4],
							src_ptr,
							src_pitch );
					}
					else
					{
						_mali_osu_tex32_l_to_tex32_b_xbgr_full_block(
							&dst[block * 16 * 16 * 4],
							src_ptr,
							src_pitch );
					}
				}
				block++;
			}
			if( xover ) block++;
		}

		if( yover )
		{

			mali_convert_rectangle conv_rect;
			conv_rect.sx = 0;
			conv_rect.sy = yfull;
			conv_rect.dx = 0;
			conv_rect.dy = yfull;
			conv_rect.width = xfull;
			conv_rect.height = yover;

			_tex32_l_to_tex32_b_alpha_to_one_partial(
				dst,
				dst_nonpre,
				src,
				&conv_rect,
				src_pitch,
				width_aligned,
				rev_order );
		}

		if( xover )
		{
			mali_convert_rectangle conv_rect;
			conv_rect.sx = xfull;
			conv_rect.sy = 0;
			conv_rect.dx = xfull;
			conv_rect.dy = 0;
			conv_rect.width = xover;
			conv_rect.height = height;

			_tex32_l_to_tex32_b_alpha_to_one_partial(
				dst,
				dst_nonpre,
				src,
				&conv_rect,
				src_pitch,
				width_aligned,
				rev_order );
		}
	}
#else
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = 0;
		conv_rect.sy = 0;
		conv_rect.dx = 0;
		conv_rect.dy = 0;
		conv_rect.width = width;
		conv_rect.height = height;

		_tex32_l_to_tex32_b_alpha_to_one_partial(
			dst,
			dst_nonpre,
			src,
			&conv_rect,
			src_pitch,
			width_aligned,
			rev_order);
	}
#endif

