NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
}

void _mali_convert_tex32_l_to_tex32_b(
	u8*          dst,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch )
{
	u32 x, y;
	u32 xfull, block, xover, width_aligned;

	/* Calculate the number of full width / height blocks. */
	width_aligned = MALI_ALIGN( width, 16 );
	xfull = (width >> 4) << 4;
	xover = width - xfull;
	block = 0;

	/* Do full block interleaving if available. Partial interleaving 
	 * done on outer remaining rectangles */
#if MALI_TEX32_L_TO_TEX32_B_FULL_BLOCK_DEFINED
	{
		u32 yfull, yover;

		yfull = (height >> 4) << 4;
		yover = height - yfull;

		for( y=0; y<yfull; y+=16 )
		{
			for( x=0; x<xfull; x+=16 )
			{
				const u8* src_ptr = src + (x*4) + (y * src_pitch);
				_mali_osu_tex32_l_to_tex32_b_full_block(
					&dst[block * 16 * 16 * 4],
					src_ptr,
					src_pitch );
				block++;
			}
			if( xover ) block++;
		}
		if( yover )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_tex32_l_to_tex32_b_full_width(
					&dst[block * 16 * 16 * 4],
					&src[(x*4) + (y * src_pitch)],
					yover,
					src_pitch );
				block++;
			}
		}
	}
#else
	for( y=0; y<height; y+=16 )
	{
		u32 yblock = height - y;
		if( yblock > 16 )
		{
			yblock = 16;
		}

		for( x=0; x<xfull; x+=16 )
		{
			_tex32_l_to_tex32_b_full_width(
				&dst[block * 16 * 16 * 4],
				&src[(x*4) + (y * src_pitch)],
				yblock,
				src_pitch );
			block++;
		}

		if( xover ) block++;
	}
#endif

	if( xover )
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = xfull;
		conv_rect.sy = 0;
		conv_rect.dx = xfull;
		conv_rect.dy = 0;
		conv_rect.width = xover;
		conv_rect.height = height;

		_tex32_l_to_tex32_b_partial(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned );
	}
}

void _mali_convert_tex32_l_to_tex32_b_swap(
	u8*          dst,
	const u8*    src,
	u32          width,
	u32          height,
	s32          src_pitch,
	u32			mask )
{
	u32 x, y;
	u32 xfull, block, xover, width_aligned;

	/* Calculate the number of full width / height blocks. */
	width_aligned = MALI_ALIGN( width, 16 );
	xfull = (width >> 4) << 4;
	xover = width - xfull;
	block = 0;

	/* Do full block interleaving if available. Partial interleaving 
	 * done on outer remaining rectangles */
#if MALI_TEX32_L_TO_TEX32_B_FULL_BLOCK_SWAP_DEFINED
	{
		u32 yfull, yover;

		yfull = (height >> 4) << 4;
		yover = height - yfull;

		for( y=0; y<yfull; y+=16 )
		{
			for( x=0; x<xfull; x+=16 )
			{
				const u8* src_ptr = src + (x*4) + (y * src_pitch);
				_mali_osu_tex32_l_to_tex32_b_full_block(
					&dst[block * 16 * 16 * 4],
					src_ptr,
					src_pitch );
				block++;
			}
			if( xover ) block++;
		}
		if( yover )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_tex32_l_to_tex32_b_full_width_swap(
					&dst[block * 16 * 16 * 4],
					&src[(x*4) + (y * src_pitch)],
					yover,
					src_pitch, mask);
				block++;
			}
		}
	}
#else
	for( y=0; y<height; y+=16 )
	{
		u32 yblock = height - y;
		if( yblock > 16 )
		{
			yblock = 16;
		}

		for( x=0; x<xfull; x+=16 )
		{
			_tex32_l_to_tex32_b_full_width_swap(
				&dst[block * 16 * 16 * 4],
				&src[(x*4) + (y * src_pitch)],
				yblock,
				src_pitch, mask );
			block++;
		}

		if( xover ) block++;
	}
#endif

	if( xover )
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = xfull;
		conv_rect.sy = 0;
		conv_rect.dx = xfull;
		conv_rect.dy = 0;
		conv_rect.width = xover;
		conv_rect.height = height;

		_tex32_l_to_tex32_b_partial_swap(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned, mask );
	}
}

void _mali_convert_tex8_l_to_tex8_b(
 	u8*          dst,
 	const u8*    src,
 	u32          width,
 	u32          height,
 	s32          src_pitch )
{
 	u32 x, y;
	u32 xfull, block, xover, width_aligned;
 
 	/* Calculate the number of full width / height blocks. */
 	width_aligned = MALI_ALIGN( width, 16 );
 	xfull = (width >> 4) << 4;
 	block = 0;
 	xover = width - xfull;
 
 	/* Do full block interleaving if available. Partial horizontal interleaving 
 	 * is done on outer remaining rectangles */
#if MALI_TEX8_L_TO_TEX8_B_FULL_BLOCK_DEFINED
 	{
 		u32 yfull, yover;
 
 		yfull = (height >> 4) << 4;
 		yover = height - yfull;
 
 		for( y=0; y<yfull; y+=16 )
 		{
 			for( x=0; x<xfull; x+=16 )
 			{
 				_mali_osu_tex8_l_to_tex8_b_full_block(
 					&dst[block * 16 * 16],
 					&src[x + (y * src_pitch)],
 					src_pitch );
 				block++;
 			}
 			if( xover ) block++;
 		}
 		if( yover )
 		{
 			for( x=0; x<xfull; x+=16 )
 			{
 				_tex8_l_to_tex8_b_full_width(
 					&dst[block * 16 * 16],
 					&src[x + (y * src_pitch)],
 					yover,
 					src_pitch );
 				block++;
 			}
 		}
 	}
#else
 	for( y=0; y<height; y+=16 )
 	{
 		u32 yblock = height - y;
 		if( yblock > 16 )
 		{
 			yblock = 16;
 		}
 
 		for( x=0; x<xfull; x+=16 )
 		{
 			_tex8_l_to_tex8_b_full_width(
 				&dst[block * 16 * 16],
 				&src[x + (y * src_pitch)],
 				yblock,
 				src_pitch );
 			block++;
 		}
 		if( xover ) block++;
 	}
#endif
 	if( xover )
 	{
 		mali_convert_rectangle conv_rect;
 		conv_rect.sx = xfull;
 		conv_rect.sy = 0;
 		conv_rect.dx = xfull;
 		conv_rect.dy = 0;
 		conv_rect.width = xover;
 		conv_rect.height = height;
 
 		_tex8_l_to_tex8_b_partial(
 			dst,
 			src,
 			&conv_rect,
 			src_pitch,
 			width_aligned );
 	}
}

void _mali_convert_tex24_l_to_tex24_b(
	u8*               dst,
	const u8*         src,
	u32               width,
	u32               height,
	s32               src_pitch )
{
	u32 x, y;
	u32 xfull, block, xover, width_aligned;

	/* Calculate the number of full width / height blocks. */
	xfull = (width >> 4) << 4;
	width_aligned = MALI_ALIGN( width, 16 );
	xover = width - xfull;
	block = 0;

	/* Do full block interleaving if available. Partial horizontal interleaving 
	 * is done on outer remaining rectangles */
#if MALI_TEX24_L_TO_TEX24_B_FULL_BLOCK_DEFINED
	{
		u32 yfull, yover;
		
		yfull = (height >> 4) << 4;
		yover = height - yfull;

		for( y=0; y<yfull; y+=16 )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_mali_osu_tex24_l_to_tex24_b_full_block(
					&dst[block * 16 * 16 * 3],
					&src[(x*3) + (y * src_pitch)],
					src_pitch );
				block++;
			}
			if ( xover ) block++;
		}
		if( yover )
		{
			for( x=0; x<xfull; x+=16 )
			{
				_tex24_l_to_tex24_b_full_width(
					&dst[block * 16 * 16 * 3],
					&src[(x*3) + (y * src_pitch)],
					yover,
					src_pitch );
				block++;
			}
		}
	}
#else
	for( y=0; y<height; y+=16 )
	{
		u32 yblock = height - y;
		if( yblock > 16 )
		{
			yblock = 16;
		}

