NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
		for( x=0; x<xfull; x+=16 )
		{
			_tex24_l_to_tex24_b_full_width(
				&dst[block * 16 * 16 * 3],
				&src[(x*3) + (y * src_pitch)],
				yblock,
				src_pitch );
			block++;
		}
		if ( xover ) block++;
	}
#endif
	if( xover )
	{
		mali_convert_rectangle conv_rect;
		conv_rect.sx = xfull;
		conv_rect.sy = 0;
		conv_rect.dx = xfull;
		conv_rect.dy = 0;
		conv_rect.width = xover;
		conv_rect.height = height;

		_tex24_l_to_tex24_b_partial(
			dst,
			src,
			&conv_rect,
			src_pitch,
			width_aligned );
	}
}

/**
 * Converts 32-bit linear textures doing red blue swap.
 * @param convert_request
 * @param ptrs_unaligned
 */
void _mali_convert_tex32_l_to_tex32_l_swap(const mali_convert_request* convert_request , mali_bool ptrs_unaligned )
{
	MALI_DEBUG_ASSERT_POINTER( convert_request );
	MALI_DEBUG_ASSERT( M200_TEXTURE_ADDRESSING_MODE_LINEAR == convert_request->src_format.texel_layout , ("Src must be M200_TEXTURE_ADDRESSING_MODE_LINEAR") );
	MALI_DEBUG_ASSERT( M200_TEXTURE_ADDRESSING_MODE_LINEAR == convert_request->dst_format.texel_layout , ("Dst must be M200_TEXTURE_ADDRESSING_MODE_LINEAR") );
	MALI_DEBUG_ASSERT( MALI_PIXEL_FORMAT_A8R8G8B8 == convert_request->src_format.pixel_format, ("Src pixel formtat must be MALI_PIXEL_FORMAT_A8R8G8B8") );
	MALI_DEBUG_ASSERT( MALI_PIXEL_FORMAT_A8R8G8B8 == convert_request->dst_format.pixel_format, ("Dst pixel formtat must be MALI_PIXEL_FORMAT_A8R8G8B8") );
	MALI_DEBUG_ASSERT( convert_request->dst_format.red_blue_swap != convert_request->src_format.red_blue_swap, ("Src and dst red_blue_swap flags must be different"));
	MALI_DEBUG_ASSERT( convert_request->src_format.reverse_order == convert_request->dst_format.reverse_order, ("Src and dst reverse_order flags must be equal"));
	{
		u32 i,j;
		const s32 x = convert_request->rect.dx;
		const s32 y = convert_request->rect.dy;
		const s32 sx = convert_request->rect.sx;
		const s32 sy = convert_request->rect.sy;
		const u32 height = convert_request->rect.height;
		const u32 width = convert_request->rect.width;
		const s32 src_pitch = convert_request->src_pitch;
		const s32 dst_pitch = convert_request->dst_pitch;
		const u8* src_ptr = (u8*)convert_request->src_ptr;
		const u32 mask = (convert_request->dst_format.reverse_order == MALI_TRUE) ? 0xff00ff00 : 0x00ff00ff ;
		u8* dst_ptr = (u8*)convert_request->dst_ptr;
#if MALI_TEX32_L_TO_TEX32_L_SWAP 
		if( MALI_FALSE == ptrs_unaligned )
		{
			const u32 x_pixels_per_block = 1<<5; 
			const u32 x_tiles = width >> 5;
			const u32 xover = ( width - x_tiles * x_pixels_per_block ) ;
			u8 *src_texel_row = ( u8 * ) src_ptr + sy * src_pitch;
			u8 *dst_texel_row = ( u8 * ) dst_ptr + y * dst_pitch;
			for ( j = 0; j < height; ++j )
			{
				u32* src = ( u32 * ) src_texel_row + sx;
				u32* dst = ( u32 * ) dst_texel_row + x;
				for ( i = 0; i < x_tiles ; ++i )
				{
					if( MALI_FALSE == convert_request->dst_format.reverse_order )
					{
						_mali_osu_tex32_l_to_tex32_l_swap_2_4( (u8*) dst, (u8*) src  );
						
					}
					else
					{
						_mali_osu_tex32_l_to_tex32_l_swap_1_3( (u8*) dst, (u8*) src  );
					}
					src+= x_pixels_per_block;
					dst+= x_pixels_per_block;
				}
				for( i=0; i < xover ; ++i)
				{
					u32 src_texel = *src++;
					SWAP_32_NO_ORDER(src_texel);
					*dst++ = src_texel;
				}
				src_texel_row += src_pitch;
				dst_texel_row += dst_pitch;
			}
		}
		else
#else 
		MALI_IGNORE(ptrs_unaligned);
#endif	
		{	
			u8 *src_texel_row = ( u8 * ) src_ptr + sy * src_pitch;
			u8 *dst_texel_row = ( u8 * ) dst_ptr + y * dst_pitch;
			for ( j = 0; j < height; j++ )
			{
				u32* src = ( u32 * ) src_texel_row + sx;
				u32* dst = ( u32 * ) dst_texel_row + x;
				for ( i = 0; i < width; i++ )
				{
					u32 src_texel = *src++;
					SWAP_32_NO_ORDER(src_texel);
					*dst++ = src_texel;
				}
				src_texel_row += src_pitch;
				dst_texel_row += dst_pitch;
			}
		}
	}

}

#endif /* OLD_SPECIAL_CASES */

MALI_EXPORT u32 _mali_convert_setup_conversion_rules( const mali_surface_specifier *src, const mali_surface_specifier *dest )
{
	u32 conv_rules = 0;

	if ( MALI_TRUE == dest->premultiplied_alpha ) conv_rules |= MALI_CONVERT_DST_PREMULT;
	if ( MALI_SURFACE_COLORSPACE_lRGB == dest->colorspace ) conv_rules |= MALI_CONVERT_DST_LINEAR;
	if ( MALI_TRUE == __m200_texel_format_has_luminance(dest->texel_format) ) conv_rules |= MALI_CONVERT_DST_LUMINANCE;

	if ( MALI_TRUE == src->premultiplied_alpha ) conv_rules |= MALI_CONVERT_SRC_PREMULT;
	if ( MALI_SURFACE_COLORSPACE_lRGB == src->colorspace ) conv_rules |= MALI_CONVERT_SRC_LINEAR;
	if ( MALI_TRUE == __m200_texel_format_has_luminance(src->texel_format) ) conv_rules |= MALI_CONVERT_SRC_LUMINANCE;

	return conv_rules;
}

/** 
 * Helper function for asessing if two formats are the same as seen from format conversion point of view.
 * @param formata 
 * @param formatb
 */
MALI_STATIC_INLINE mali_bool _same_conversion_formats( mali_surface_specifier *formata, mali_surface_specifier *formatb )
{
	MALI_DEBUG_ASSERT_POINTER( formata );
	MALI_DEBUG_ASSERT_POINTER( formatb );

	return ( (formatb->texel_format == formata->texel_format) 
		&& (formatb->red_blue_swap == formata->red_blue_swap) 
		&& (formatb->reverse_order == formata->reverse_order)
		&& (formatb->premultiplied_alpha == formata->premultiplied_alpha )
		&& (formatb->colorspace == formata->colorspace ) );
}

MALI_EXPORT void _mali_convert_request_initialize( 
	mali_convert_request *convert_request, 
	void *dst_ptr, 
	s32 dst_pitch, 
	const mali_surface_specifier *dst_format, 
	const void *src_ptr, 
	s32 src_pitch, 
	const mali_surface_specifier *src_format, 
	void *dst_nonpre_ptr, 
	s32 dst_nonpre_pitch,
	const mali_convert_rectangle *rect,
	mali_bool src_is_malimem,
	mali_bool dst_is_malimem,
	mali_bool alpha_clamp,
	mali_convert_request_source source )
{
	MALI_DEBUG_ASSERT_POINTER( convert_request );
	MALI_DEBUG_ASSERT_POINTER( dst_format );
	MALI_DEBUG_ASSERT_POINTER( rect );
	MALI_DEBUG_ASSERT_POINTER( src_format );

	convert_request->dst_ptr = dst_ptr;
	convert_request->dst_pitch = ( M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED == dst_format->texel_layout ) ? MALI_ALIGN( dst_pitch, 16 ) : dst_pitch;
	convert_request->src_ptr = src_ptr;
	convert_request->src_pitch = ( M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED == src_format->texel_layout ) ? MALI_ALIGN( src_pitch, 16 ) : src_pitch;
	convert_request->dst_nonpre_ptr = dst_nonpre_ptr;
	convert_request->dst_nonpre_pitch = ( M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED == dst_format->texel_layout ) ? MALI_ALIGN( dst_nonpre_pitch, 16 ) : dst_nonpre_pitch;
	convert_request->alpha_clamp = alpha_clamp;
	convert_request->src_is_malimem = src_is_malimem;
	convert_request->dst_is_malimem = dst_is_malimem;
	convert_request->source = source;

	_mali_sys_memcpy( &convert_request->dst_format, dst_format, sizeof( mali_surface_specifier ) );
	_mali_sys_memcpy( &convert_request->src_format, src_format, sizeof( mali_surface_specifier ) );
	_mali_sys_memcpy( &convert_request->rect, rect, sizeof( mali_convert_rectangle ) );
}

/**
 * Helper function to test if conversion is not a pure color conversion
 * @param convert_request 
 */
MALI_STATIC_INLINE mali_bool _conversion_not_color( const mali_convert_request *convert_request )
{
	const mali_bool format_not_color[] = {
		MALI_FALSE, /* MALI_TRUE, M200_TEXEL_FORMAT_L_1 = 0, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_1 = 1,*/
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_1 = 2, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_11 = 3, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_4 = 4, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_4 = 5, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_4 = 6, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_1111 = 7, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_44 = 8, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_8 = 9, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_8 = 10, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_8 = 11, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_332 = 12, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2222 = 13, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_565 = 14, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_1555 = 15, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_4444 = 16, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_88 = 17, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_16 = 18, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_16 = 19, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_16 = 20, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_888 = 21, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_8888 = 22, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_xRGB_8888 = 23, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2_10_10_10 = 24, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_11_11_10 = 25, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_10_12_10 = 26, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_16_16 = 27, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_16_16_16_16 = 28, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_PAL_4 = 29, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_PAL_8 = 30, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_FLXTC = 31, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ETC = 32, */
		MALI_TRUE, /* 33 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_FP16 = 34, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_FP16 = 35, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_FP16 = 36, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_FP16 = 37, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_FP16 = 38, */
		MALI_TRUE, /* 39 is Reserved */
		MALI_TRUE, /* 40 is Reserved */
		MALI_TRUE, /* 41 is Reserved */
		MALI_TRUE, /* 42 is Reserved */
		MALI_TRUE, /* 43 is Reserved */
		MALI_TRUE, /* M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8 = 44, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_CONVOLUTION_TEXTURE_64 = 45, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_16_16_16 = 46, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_FP16 = 47, */
		MALI_TRUE, /* 48 is Reserved */
		MALI_TRUE, /* 49 is Reserved */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VERBATIM_COPY32 = 50, */
		MALI_TRUE, /* 51 is Reserved */
		MALI_TRUE, /* 52 is Reserved */
		MALI_TRUE, /* M200_TEXEL_FORMAT_YCCA = 53, */
		MALI_TRUE, /* 54 is Reserved */
		MALI_TRUE, /* 55 is Reserved */
		MALI_TRUE, /* 56 is Reserved */
		MALI_TRUE, /* 57 is Reserved */
		MALI_TRUE, /* 58 is Reserved */
		MALI_TRUE, /* 59 is Reserved */
		MALI_TRUE, /* 60 is Reserved */
		MALI_TRUE, /* 61 is Reserved */
		MALI_TRUE, /* 62 is Reserved */
		MALI_TRUE, /* M200_TEXEL_FORMAT_NO_TEXTURE = 63, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH32 = 64, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH16 = 65, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_STENCIL_DEPTH_8_24 = 66, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_RGB888 = 67, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_16_0 */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_24_0 */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_4 */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_8 */
	};
	return format_not_color[convert_request->src_format.texel_format] || format_not_color[convert_request->dst_format.texel_format];
}

/**
 * Helper function for testing if conversion request is supported.
 * @param convert_request
 */
MALI_STATIC_INLINE mali_bool _conversion_supported( const mali_convert_request *convert_request )
{
	const mali_bool format_supported[] = {
		MALI_TRUE, /* M200_TEXEL_FORMAT_L_1 = 0, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_A_1 = 1, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_I_1 = 2, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_11 = 3, DISABLED DUE TO LACKING TESTS */
		MALI_TRUE, /* M200_TEXEL_FORMAT_L_4 = 4, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_A_4 = 5, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_I_4 = 6, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_1111 = 7, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_AL_44 = 8, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_L_8 = 9, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_A_8 = 10, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_I_8 = 11, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_332 = 12, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2222 = 13, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_565 = 14, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_1555 = 15, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_4444 = 16, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_AL_88 = 17, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_16 = 18, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_16 = 19, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_16 = 20, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_888 = 21, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_8888 = 22, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_xRGB_8888 = 23, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2_10_10_10 = 24, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_11_11_10 = 25, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_10_12_10 = 26, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_16_16 = 27, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_16_16_16_16 = 28, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_PAL_4 = 29, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_PAL_8 = 30, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_FLXTC = 31, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ETC = 32, */
		MALI_FALSE, /* 33 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_FP16 = 34, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_FP16 = 35, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_FP16 = 36, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_FP16 = 37, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_FP16 = 38, */
		MALI_FALSE, /* 39 is Reserved */
		MALI_FALSE, /* 40 is Reserved */
		MALI_FALSE, /* 41 is Reserved */
		MALI_FALSE, /* 42 is Reserved */
		MALI_FALSE, /* 43 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8 = 44, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_CONVOLUTION_TEXTURE_64 = 45, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_16_16_16 = 46, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_FP16 = 47, */
		MALI_FALSE, /* 48 is Reserved */
		MALI_FALSE, /* 49 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VERBATIM_COPY32 = 50, */
		MALI_FALSE, /* 51 is Reserved */
		MALI_FALSE, /* 52 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_YCCA = 53, */
		MALI_FALSE, /* 54 is Reserved */
		MALI_FALSE, /* 55 is Reserved */
		MALI_FALSE, /* 56 is Reserved */
		MALI_FALSE, /* 57 is Reserved */
		MALI_FALSE, /* 58 is Reserved */
		MALI_FALSE, /* 59 is Reserved */
		MALI_FALSE, /* 60 is Reserved */
		MALI_FALSE, /* 61 is Reserved */
		MALI_FALSE, /* 62 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_NO_TEXTURE = 63, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH32 = 64, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH16 = 65, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_STENCIL_DEPTH_8_24 = 66, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_RGB888 = 67, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_16_0 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_24_0 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_4 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_8 */
	};
	MALI_DEBUG_ASSERT_POINTER( convert_request );
	
	return format_supported[convert_request->src_format.texel_format] && format_supported[convert_request->dst_format.texel_format];
}

/**
 * Helper function for testing if conversion request is supported in NEON.
 * @param convert_request
 */
MALI_STATIC_INLINE mali_bool _neon_conversion_supported( const mali_convert_request *convert_request )
{
	const mali_bool neon_format_supported[] = {
		MALI_FALSE, /* MALI_FALSE, M200_TEXEL_FORMAT_L_1 = 0, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_1 = 1,*/
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_1 = 2, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_11 = 3, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_4 = 4, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_4 = 5, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_4 = 6, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_1111 = 7, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_44 = 8, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_L_8 = 9, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_A_8 = 10, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_I_8 = 11, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_332 = 12, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2222 = 13, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_565 = 14, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_1555 = 15, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_4444 = 16, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_AL_88 = 17, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_16 = 18, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_16 = 19, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_16 = 20, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_RGB_888 = 21, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_ARGB_8888 = 22, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_xRGB_8888 = 23, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_2_10_10_10 = 24, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_11_11_10 = 25, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_10_12_10 = 26, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_16_16 = 27, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_16_16_16_16 = 28, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_PAL_4 = 29, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_PAL_8 = 30, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_FLXTC = 31, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ETC = 32, */
		MALI_FALSE, /* 33 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_L_FP16 = 34, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_A_FP16 = 35, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_I_FP16 = 36, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_AL_FP16 = 37, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_ARGB_FP16 = 38, */
		MALI_FALSE, /* 39 is Reserved */
		MALI_FALSE, /* 40 is Reserved */
		MALI_FALSE, /* 41 is Reserved */
		MALI_FALSE, /* 42 is Reserved */
		MALI_FALSE, /* 43 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8 = 44, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_CONVOLUTION_TEXTURE_64 = 45, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_16_16_16 = 46, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_RGB_FP16 = 47, */
		MALI_FALSE, /* 48 is Reserved */
		MALI_FALSE, /* 49 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VERBATIM_COPY32 = 50, */
		MALI_FALSE, /* 51 is Reserved */
		MALI_FALSE, /* 52 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_YCCA = 53, */
		MALI_FALSE, /* 54 is Reserved */
		MALI_FALSE, /* 55 is Reserved */
		MALI_FALSE, /* 56 is Reserved */
		MALI_FALSE, /* 57 is Reserved */
		MALI_FALSE, /* 58 is Reserved */
		MALI_FALSE, /* 59 is Reserved */
		MALI_FALSE, /* 60 is Reserved */
		MALI_FALSE, /* 61 is Reserved */
		MALI_FALSE, /* 62 is Reserved */
		MALI_FALSE, /* M200_TEXEL_FORMAT_NO_TEXTURE = 63, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH32 = 64, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH16 = 65, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_STENCIL_DEPTH_8_24 = 66, */
		MALI_TRUE, /* M200_TEXEL_FORMAT_VIRTUAL_RGB888 = 67, */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_16_0 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_24_0 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_4 */
		MALI_FALSE, /* M200_TEXEL_FORMAT_VIRTUAL_DEPTH_STENCIL_0_8 */
	};
	MALI_DEBUG_ASSERT_POINTER( convert_request );

	return neon_format_supported[convert_request->src_format.texel_format] && neon_format_supported[convert_request->dst_format.texel_format];
}

/**
 * Helper function do decide whether or not NEON fastpath can be taken.
 */
mali_bool _mali_convert_can_do_fastpath(
	mali_convert_request *convert_request,
	mali_bool blocked_offset,
	mali_bool do_swizzle,
	mali_bool ptrs_unaligned,
	mali_bool same_formats,
	mali_bool store_nonpre_data,
	mali_bool subbyte_format )
{

	if (MALI_TRUE == ptrs_unaligned || MALI_TRUE == subbyte_format || MALI_TRUE == blocked_offset)
	{
		return MALI_FALSE;
	}
	/* If we only need to do swizzle */
	if (MALI_TRUE == do_swizzle && MALI_TRUE == same_formats && MALI_FALSE == store_nonpre_data)
	{
		return MALI_TRUE;
	}

	return _neon_conversion_supported(convert_request);
}

