NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
MALI_STATIC_INLINE void _mali_convert_texture_slowpath(
	mali_convert_request *convert_request,
	s32 startx,
	s32 endx,
	s32 starty,
	s32 endy,
	u32 src_bpp,
	u32 dst_bpp,
	mali_bool src_blocked,
	mali_bool dst_blocked,
	u32 conv_rules_nonpre,
	u32 conv_rules_premult,
	mali_bool pass_through,
	mali_bool same_formats )
{
	s32 i, j;
	u32 src_address, dst_address;
	const s32 src_bytespp = src_bpp >> 3;
	const s32 dst_bytespp = dst_bpp >> 3;
	const s32 src_width_aligned = MALI_ALIGN( convert_request->src_format.width, 16 );
	const s32 dst_width_aligned = MALI_ALIGN( convert_request->dst_format.width, 16 );

	for (j = starty; j < endy; j++)
	{
		const u32 src_y = convert_request->rect.sy + j;
		const u32 src_cur_row = src_y * convert_request->src_pitch;

		const u32 dst_y = convert_request->rect.dy + j;
		const u32 dst_cur_row = dst_y * convert_request->dst_pitch;

		for (i = startx; i < endx; i++)
		{
			s32 ks, kd;
			u32 src_texel = 0;
			u32 premult_texel;
			const u32 src_x = convert_request->rect.sx + i;
			const u32 dst_x = convert_request->rect.dx + i;

			/* If no form of conversion is needed */
			if (MALI_TRUE == pass_through && src_bpp >= 8)
			{
				if (MALI_TRUE == src_blocked)
				{
					src_address = MALI_CONVERT_BLOCKED_ADDRESS(src_x, src_y, src_width_aligned) * src_bytespp;
				}
				else
				{
					src_address = src_cur_row + src_x * src_bytespp;
				}
				if (MALI_TRUE == dst_blocked)
				{
					dst_address = MALI_CONVERT_BLOCKED_ADDRESS(dst_x, dst_y, dst_width_aligned) * dst_bytespp;
				}
				else
				{
					dst_address = dst_cur_row + dst_x * dst_bytespp;
				}

				_mali_sys_memcpy((u8*)convert_request->dst_ptr + dst_address,(u8*)convert_request->src_ptr + src_address, src_bytespp); 

				if (convert_request->dst_nonpre_ptr != NULL)
				{
					_mali_sys_memcpy((u8*)convert_request->dst_nonpre_ptr + dst_address,(u8*)convert_request->src_ptr + src_address, src_bytespp);
				}
				continue;
			}

			/* Read source texel */
			switch (src_bpp)
			{
				case 1:
				{
					ks = src_x  >> 3;
					ks = src_x - ( ks << 3 );
					src_texel = *( ( u8 * ) ( ( u32 ) convert_request->src_ptr + src_cur_row + ( src_x  >> 3 ) ) );
					src_texel >>= ks;
					src_texel = ( src_texel & 0x1 );
					break;
				}
				case 2:
				{
					ks = ( (src_x & 0x3) << 1 );
					src_texel = *( ( u8 * ) ( ( u32 ) convert_request->src_ptr + src_cur_row + ( src_x  >> 2 ) ) );
					src_texel >>= ks;
					src_texel = ( src_texel & 0x3 );
					break;
				}
				case 4:
				{
					ks =  (src_x  & 1) ? 4 : 0;
					src_texel = *( ( u8 * ) ( ( u32 ) convert_request->src_ptr + src_cur_row + ( src_x  >> 1 ) ) );
					src_texel >>= ks;
					src_texel = ( src_texel & 0x0F );
					break;
				}
				case 8:
				case 16:
				case 24:
				case 32:
				{	
					if (MALI_TRUE == src_blocked)
					{
						src_address = MALI_CONVERT_BLOCKED_ADDRESS(src_x, src_y, src_width_aligned) * src_bytespp;
					}
					else
					{
						src_address = src_cur_row + src_x * src_bytespp;
					}

					_mali_sys_memcpy(&src_texel, (u8*)convert_request->src_ptr + src_address, src_bytespp);
					break;
				}
				default:
					MALI_DEBUG_ASSERT(0, ("Not yet implemented"));
			}

			/* Do the actual conversion per texel */
			if (MALI_TRUE == pass_through)
			{
				premult_texel = src_texel;
			}
			else
			{
				premult_texel = _mali_convert_texel(&convert_request->src_format, &convert_request->dst_format, src_texel, conv_rules_premult, convert_request->source);
			}

			/* Place texel in correct dst position */
			switch (dst_bpp)
			{
				case 1:
				{
					u32 dst_texel;
					kd = dst_x >> 3;
					kd = dst_x - ( kd << 3 );
					dst_texel = ( (u8*) convert_request->dst_ptr + dst_cur_row )[ dst_x  >> 3 ] & ~( 1 << kd );
					( (u8*) convert_request->dst_ptr + dst_cur_row )[ dst_x >> 3 ] = dst_texel | ( premult_texel << kd );
					break;
				}
				case 2:
				{
					u32 dst_texel;
					kd = ( (dst_x & 0x3) << 1 );
					dst_texel = ( (u8*) convert_request->dst_ptr + src_cur_row )[ dst_x >> 2 ] & ~( 1 << kd );
					( (u8*) convert_request->dst_ptr + dst_cur_row )[ dst_x >> 2 ] = dst_texel | ( premult_texel << kd );
					break;
				}
				case 4:
				{	
					u32 dst_texel;
					kd = dst_x & 1 ? 4 : 0;
					dst_texel = ( (u8*) convert_request->dst_ptr + dst_cur_row )[ dst_x >> 1 ] & ( kd ? 0x0F : 0xF0 );
					( (u8*) convert_request->dst_ptr + dst_cur_row )[ dst_x >> 1 ] = dst_texel | ( premult_texel << kd );
					break;
				}
				case 8:
				case 16:
				case 24:
				case 32:
				{	
					if (MALI_TRUE == dst_blocked)
					{
						dst_address = MALI_CONVERT_BLOCKED_ADDRESS(dst_x, dst_y, dst_width_aligned) * dst_bytespp;
					}
					else
					{
						dst_address = dst_x*dst_bytespp + dst_cur_row;
					}

					if (convert_request->dst_nonpre_ptr != NULL && MALI_FALSE == same_formats)
					{
						src_texel = _mali_convert_texel(&convert_request->src_format, &convert_request->dst_format, src_texel, conv_rules_nonpre, convert_request->source);
					}

					_mali_sys_memcpy((u8*)convert_request->dst_ptr + dst_address, &premult_texel, dst_bytespp);

					if (convert_request->dst_nonpre_ptr != NULL)
					{
						_mali_sys_memcpy((u8*)convert_request->dst_nonpre_ptr + dst_address, &src_texel, dst_bytespp);
					}
					break;
				}
				default:
					MALI_DEBUG_ASSERT(0, ("Not yet implemented"));
			}
		}
	}
}

MALI_EXPORT mali_bool _mali_convert_texture(mali_convert_request *convert_request)
{

#define IS_UNALIGNED( src_ptr, texel_size ) (((u32)(src_ptr)) & ((texel_size)-1))

	mali_bool alpha_to_one;
	mali_bool blocked_offset;
	mali_bool both_linear;
	mali_bool do_deswizzle;
	mali_bool do_neon;
	mali_bool do_swizzle;
	mali_bool dst_blocked;
	mali_bool pass_through;
	mali_bool ptrs_unaligned;
	mali_bool retval;
	mali_bool same_formats;
	mali_bool src_blocked;
	mali_bool store_nonpre_data;
	mali_bool subarea;
	mali_bool subbyte_format;
	const u8 *src_ptr;
	u8 *dst_ptr;
	void *dst_nonpre_ptr;
	s32 src_pitch, dst_pitch;
	s32 src_bpp, dst_bpp, src_bytespp, dst_bytespp;
	s32 sx, sy, dx, dy;
	s32 width, height;
	u32 conv_rules_nonpre, conv_rules_premult;
	u16 src_width, src_height, dst_width, dst_height;
	s32 src_width_aligned, dst_width_aligned;
	const u16 src_surfspec = PACK_SURFSPEC( &convert_request->src_format );
	const u16 dst_surfspec = PACK_SURFSPEC( &convert_request->dst_format );
	/* Loop variables */
	s32 i, j, k, l;
	u32 src_address, dst_address;
	s32 xfull, yfull, xover, yover, tile;

#if MALI_BIG_ENDIAN
	void *cpu_ptr = NULL;
#endif

#if OLD_SPECIAL_CASES
	mali_bool both_blocked;
	mali_bool both_32b_argb;
	mali_bool rbswap_mismatch;
#endif

	height = convert_request->rect.height;
	width = convert_request->rect.width;
	src_width = convert_request->src_format.width;
	src_height = convert_request->src_format.height;
	src_width_aligned = MALI_ALIGN( src_width, 16 );
	dst_width = convert_request->dst_format.width;
	dst_height = convert_request->dst_format.height;
	dst_width_aligned = MALI_ALIGN( dst_width, 16 );

