NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
	MALI_DEBUG_ASSERT_POINTER( convert_request );
	MALI_DEBUG_ASSERT( NULL != convert_request->src_ptr && NULL != convert_request->dst_ptr, ("Invalid conversion request. Need valid src and dst pointers!") );

	src_ptr = (u8*)convert_request->src_ptr;
	dst_ptr = (u8*)convert_request->dst_ptr;
	dst_nonpre_ptr = convert_request->dst_nonpre_ptr;
	src_bpp = __m200_texel_format_get_bpp(convert_request->src_format.texel_format);
	dst_bpp = __m200_texel_format_get_bpp(convert_request->dst_format.texel_format);
	src_bytespp = src_bpp >> 3;
	dst_bytespp = dst_bpp >> 3;
	src_pitch = convert_request->src_pitch;
	dst_pitch = convert_request->dst_pitch;

	/* JIRA ticket 2694 */
	MALI_IGNORE(src_height);
	MALI_IGNORE(src_width_aligned);
	MALI_IGNORE(dst_surfspec);
	MALI_IGNORE(src_surfspec);
	MALI_IGNORE(src_address);
	MALI_IGNORE(dst_address);

	ptrs_unaligned = IS_UNALIGNED(src_ptr, src_bytespp) || IS_UNALIGNED(dst_ptr, dst_bytespp);
	store_nonpre_data = (dst_nonpre_ptr != NULL) ? MALI_TRUE : MALI_FALSE;
	subbyte_format = ((src_bpp % 8) != 0) ? MALI_TRUE : MALI_FALSE;

	/* Some helper booleans for cleaner code */
	alpha_to_one = convert_request->src_format.alpha_to_one || convert_request->dst_format.alpha_to_one;
	both_linear = ( convert_request->src_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_LINEAR &&
		        convert_request->dst_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_LINEAR );
	do_swizzle = ( convert_request->src_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_LINEAR &&
		       convert_request->dst_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED );
	do_deswizzle = ( convert_request->src_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED &&
		         convert_request->dst_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_LINEAR );
	same_formats = _same_conversion_formats( &convert_request->src_format, &convert_request->dst_format );
	src_blocked = convert_request->src_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED;
	dst_blocked = convert_request->dst_format.texel_layout == M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED;
	blocked_offset = ( (src_blocked && convert_request->rect.sy + convert_request->rect.sx > 0) ||
		           (dst_blocked && convert_request->rect.dy + convert_request->rect.dx > 0) );

	do_neon = _mali_convert_can_do_fastpath(
			convert_request,
			blocked_offset,
			do_swizzle,
			ptrs_unaligned,
			same_formats,
			store_nonpre_data,
			subbyte_format );

	MALI_DEBUG_ASSERT( (0 != width + height)
		|| (convert_request->rect.dx + width <= dst_width)
		|| (convert_request->rect.dy + height <= dst_height), ("Invalid conversion request. Need valid area!") );
	MALI_DEBUG_CODE( if ( M200_TEXEL_FORMAT_xRGB_8888 == convert_request->src_format.texel_format ) \
		MALI_DEBUG_ASSERT( MALI_FALSE == convert_request->src_format.reverse_order, ("HW issue 10983 violated. xRGB format with reverse order flag is unsupported.") ); );
	MALI_DEBUG_CODE( if ( MALI_TRUE == __m200_texel_format_is_alpha( convert_request->src_format.texel_layout ) ) MALI_DEBUG_ASSERT( MALI_TRUE == convert_request->src_format.alpha_to_one, ("src_format is alpha only and has alpha_to_one set which makes no sense." ) ); );
	MALI_DEBUG_CODE( if ( MALI_TRUE == __m200_texel_format_is_alpha( convert_request->dst_format.texel_layout ) ) MALI_DEBUG_ASSERT( MALI_TRUE == convert_request->dst_format.alpha_to_one, ("dst_format is alpha only and has alpha_to_one set which makes no sense." ) ); );

	/* Do not support conversions in dimensions (e.g. M200_TEXTURE_ADDRESSING_MODE_LINEAR -> M200_TEXTURE_ADDRESSING_MODE_2D_INTERLEAVED) */
	if (!((convert_request->src_format.texel_layout == convert_request->dst_format.texel_layout) || do_swizzle || do_deswizzle))
	{
		return MALI_FALSE;
	}

	/* 
	* The function assumes that source is in cpu byte order and changing it to
	* handle both endianess is major effort. Instead the source buffer is  
	* converted to cpu byte in a local buffer, this local buffer is then 
	* used as source. Destination is swapped to mali order if necessary.
	*/
#if MALI_BIG_ENDIAN 
	if (MALI_TRUE == convert_request->src_is_malimem)
	{
		s32 j;
		cpu_ptr = _mali_sys_malloc( src_pitch * height );
		if (NULL == cpu_ptr)
		{
			return MALI_FALSE;
		}

		for (j = 0; j < convert_request->rect.sy; j++)
		{
			s32 offset = src_pitch * j + convert_request->rect.sx * src_bytespp;
			_mali_sys_memcpy( cpu_ptr + offset, src_ptr + offset, src_pitch );
			_mali_byteorder_swap_endian( cpu_ptr, width * src_bytespp, src_bytespp );
		}
		src_ptr = cpu_ptr;
		convert_request->rect.sy = 0;
		sy = 0;
	}
#else
	sy = convert_request->rect.sy;
#endif
	sx = convert_request->rect.sx;
	dx = convert_request->rect.dx;
	dy = convert_request->rect.dy;

	subarea = ( (sx + sy + dx + dy > 0) ||
		(width + height != dst_width + dst_height) ); 

	/* SPECIAL CASES */

#if OLD_SPECIAL_CASES
	both_blocked = src_blocked && dst_blocked;

	/* Alpha to one fast path */
	if (MALI_FALSE == both_blocked && MALI_FALSE == do_deswizzle && MALI_TRUE == alpha_to_one && MALI_TRUE == same_formats && src_bpp == 32)
	{
		if (MALI_TRUE == do_swizzle)
		{
			if (MALI_FALSE == subarea)
			{
				_mali_convert_tex32_l_to_tex32_b_alpha_to_one(
					dst_ptr,
					dst_nonpre_ptr,
					src_ptr,
					dst_width,
					dst_height,
					src_pitch,
					convert_request->src_format.reverse_order );
			}
			else
			{
				_tex32_l_to_tex32_b_alpha_to_one_partial(
					dst_ptr,
					convert_request->dst_nonpre_ptr,
					src_ptr,
					&convert_request->rect,
					src_pitch,
					dst_width_aligned,
					convert_request->src_format.reverse_order );
			}
		}
		else
		{
			u8 *dst;
			u8 *src;
			u32 alpha_mask = (convert_request->src_format.reverse_order ? 0xFF : 0xFF000000);

			src = (u8*)src_ptr + sx * src_bytespp + sy * src_pitch;
			dst = dst_ptr + dx * dst_bytespp + dy * dst_pitch;
			if (MALI_TRUE == store_nonpre_data)
			{
				u8 *dst_nonpre = (u8*)dst_nonpre_ptr + dx * dst_bytespp + dy * dst_pitch;
				for (j = 0; j < height; j++)
				{
					const u32* src32 = (u32*)src;
					u32 *dst32 = (u32*)dst;
					u32 *dst32_nonpre = (u32*)dst_nonpre;
					for (i = 0; i < width; i++)
					{
						*(dst32) = *(src32++)|alpha_mask;
						*(dst32_nonpre++) = *(dst32++);
					}			
					src += src_pitch;
					dst += dst_pitch;
					dst_nonpre += dst_pitch;
				}

