NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
			}
			else
			{
				for (j = 0; j < height; j++)
				{
					const u32* src32 = (u32*)src;
					u32 *dst32 = (u32*)dst;
					for (i = 0; i < width; i++)
					{
						*(dst32++) = *(src32++)|alpha_mask;
					}			
					src += src_pitch;
					dst += dst_pitch;
				}
			}
		}

		retval = MALI_TRUE;
		goto cleanup;
	}

	both_32b_argb = MALI_PIXEL_FORMAT_A8R8G8B8 == convert_request->src_format.pixel_format && MALI_PIXEL_FORMAT_A8R8G8B8 == convert_request->dst_format.pixel_format;
	rbswap_mismatch = convert_request->dst_format.red_blue_swap != convert_request->src_format.red_blue_swap;

	/* fast path linear 32 bit to 32 bit */
	if ( MALI_TRUE == both_linear &&
	     MALI_TRUE == both_32b_argb &&
	     MALI_TRUE == rbswap_mismatch &&
	     convert_request->src_format.colorspace == convert_request->dst_format.colorspace &&
	     MALI_FALSE == store_nonpre_data )
	{
		u32 conv_rules_nonpre;
		u32 conv_rules_premult;
		u32 alpha_mask;
		
		conv_rules_nonpre = _mali_convert_setup_conversion_rules(&convert_request->src_format, &convert_request->dst_format);
		conv_rules_premult = ( convert_request->dst_nonpre_ptr ? conv_rules_nonpre | MALI_CONVERT_DST_PREMULT : conv_rules_nonpre );

		if (MALI_TRUE == convert_request->src_format.alpha_to_one)
		{
			u8 alpha_size = ( M200_TEXEL_FORMAT_xRGB_8888 == convert_request->src_format.texel_format ? 8 : __m200_texel_format_get_abits( convert_request->src_format.texel_format ) );
			u32 alpha_fill = ((1 << alpha_size)-1);
			alpha_mask = ( convert_request->src_format.reverse_order ? alpha_fill : alpha_fill << (src_bpp - alpha_size) );
		}
		else
		{
			alpha_mask = 0;
			if (MALI_FALSE == store_nonpre_data && convert_request->src_format.reverse_order == convert_request->dst_format.reverse_order)
			{
				_mali_convert_tex32_l_to_tex32_l_swap(convert_request, ptrs_unaligned);
				retval = MALI_TRUE;
				goto cleanup;
			}
		}
	
	  	/* 32 bit to 32 bit blocked 0 normalized 0 */
		{
			  u8 *src_texel_row = (u8*)src_ptr + sy * src_pitch;
			  u8 *dst_texel_row = (u8*)dst_ptr + dy * dst_pitch;
			  for (j = 0; j < height; j++)
			  {
				for (i = 0; i < width; i++)
				{
					u32 src_texel;
					u32 premult_texel;
					const s32 dst_x = dx + i;
					src_texel = ( *( ( u32 * ) ( MALI_REINTERPRET_CAST ( u32 * ) src_texel_row + sx + i ) ) ) | alpha_mask;
					premult_texel = _mali_convert_texel(&convert_request->src_format, &convert_request->dst_format, src_texel, conv_rules_premult, convert_request->source);
					*( MALI_REINTERPRET_CAST ( u32 * ) dst_texel_row + dst_x ) = premult_texel;
				}
				src_texel_row += src_pitch;
				dst_texel_row += dst_pitch;
			  }
		}
		retval = MALI_TRUE;
		goto cleanup;

	}

	/* If no conversion but full-area swizzling we may do fast swizzling for byte-sized formats*/
	if ( MALI_TRUE == do_swizzle &&
	     MALI_FALSE == subbyte_format &&
	     MALI_FALSE == subarea )
	{

		if (MALI_TRUE == same_formats)
		{
			if (MALI_TRUE == store_nonpre_data)
			{
				/* Fast path for swizzling of premultiplied formats with normalized storage.
				 * TODO: Support for other formats than RGBA_8888 */
				if ( MALI_FALSE == ptrs_unaligned &&
				     M200_TEXEL_FORMAT_ARGB_8888 == convert_request->src_format.texel_format &&
				     MALI_TRUE == convert_request->src_format.red_blue_swap &&
				     MALI_FALSE == convert_request->src_format.alpha_to_one )
				{
					if (MALI_TRUE == convert_request->src_format.reverse_order) 
					{
						_mali_convert_tex32_l_to_tex32_b_premult(dst_ptr, convert_request->dst_nonpre_ptr, src_ptr, dst_width, dst_height, src_pitch, MALI_TRUE);
					}
					else 
					{
						_mali_convert_tex32_l_to_tex32_b_premult(dst_ptr, convert_request->dst_nonpre_ptr, src_ptr, dst_width, dst_height, src_pitch, MALI_FALSE);
					}
					retval = MALI_TRUE;
					goto cleanup;
				}
			}
			else
			{
				switch (src_bpp)
				{
					
					case 8: 
						_mali_convert_tex8_l_to_tex8_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
						retval = MALI_TRUE;
						goto cleanup;
					case 16: 
						_mali_convert_tex16_l_to_tex16_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
						retval = MALI_TRUE;
						goto cleanup;
					case 24: 
						_mali_convert_tex24_l_to_tex24_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
						retval = MALI_TRUE;
						goto cleanup;
					case 32: 
						if (MALI_FALSE == ptrs_unaligned)
						{
							_mali_convert_tex32_l_to_tex32_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
							retval = MALI_TRUE;
							goto cleanup;
						}
						/* Fall through: If unaligned, do fallback swizzling */
					default: 
						/* For any other texel sizes use the non-optimal fallback swizzling */
						_m200_texture_interleave_16x16_blocked(dst_ptr, src_ptr, dst_width, dst_height, src_pitch, convert_request->dst_format.texel_format);
						retval = MALI_TRUE;
						goto cleanup;
				}
			}
		}
		else
		{
			if ( rbswap_mismatch &&
			     src_bpp == 32 &&
			     dst_bpp == 32 &&
			     MALI_FALSE == store_nonpre_data &&
			     convert_request->src_format.colorspace == convert_request->dst_format.colorspace &&
			     MALI_FALSE == ptrs_unaligned )
			{
				if (convert_request->dst_format.reverse_order == MALI_FALSE && convert_request->src_format.reverse_order == MALI_FALSE)
				{
					_mali_convert_tex32_l_to_tex32_b_swap(dst_ptr, src_ptr, dst_width, dst_height, src_pitch, 0x00ff00ff);
					retval = MALI_TRUE;
					goto cleanup;
				}
				else if (convert_request->dst_format.reverse_order == MALI_TRUE && convert_request->src_format.reverse_order == MALI_TRUE)
				{
					_mali_convert_tex32_l_to_tex32_b_swap(dst_ptr, src_ptr, dst_width, dst_height, src_pitch, 0xff00ff00);
					retval = MALI_TRUE;
					goto cleanup;
				}
			}
		}
	}

#endif /* OLD_SPECIAL_CASES */

	/* If neither format conversion nor swizzling is needed we do a memcpy for byte-sized formats */
	if ( MALI_FALSE == alpha_to_one &&
	     MALI_FALSE == subbyte_format &&
	     MALI_TRUE == both_linear &&
	     MALI_TRUE == same_formats &&
	     MALI_FALSE == store_nonpre_data )
	{
		if (src_pitch > 0 && src_pitch == dst_pitch && sx + dx == 0 && height + width == dst_height + dst_width)
		{
			_mali_sys_memcpy(dst_ptr + dy*dst_pitch, src_ptr + sy*src_pitch, src_pitch * height);
		}
		else
		{
			u8 *dst;
			u8 *src;

			src = (u8*)src_ptr + sx * src_bytespp + sy * src_pitch;
			dst = dst_ptr + dx * dst_bytespp + dy * dst_pitch;

			for (j = 0; j < height; j++)
			{
				_mali_sys_memcpy(dst, src, width * src_bytespp);
				src += src_pitch;
				dst += dst_pitch;
			}
		}	

		retval = MALI_TRUE;
		goto cleanup;
	}

	/* Support for swizzling of ETC textures */
	if ( convert_request->src_format.texel_format == M200_TEXEL_FORMAT_ETC &&
	     convert_request->dst_format.texel_format == M200_TEXEL_FORMAT_ETC &&
	     MALI_TRUE == do_swizzle )
	{

#define ETC_BLOCK_DIM 4
#define ETC_TEXELS_PER_BYTE 2
#define ETC_BLOCK_SIZE ( (ETC_BLOCK_DIM)*(ETC_BLOCK_DIM)/(ETC_TEXELS_PER_BYTE) )

		/* ETC does not support offsets */
		if (sx + sy + dx + dy > 0)
		{
			return MALI_FALSE;
		}

		/* ETC compresses 4x4 blocks into 64bit elements */
		width = MALI_ALIGN(width, ETC_BLOCK_DIM) / ETC_BLOCK_DIM;
		height = MALI_ALIGN(height, ETC_BLOCK_DIM) / ETC_BLOCK_DIM;
		/* Need pitch to be in bytes, not pixels */
		src_pitch = src_pitch * dst_bpp;

		/* Calculate the number of full width / height blocks. */
		xfull = (width >> 2) << 2;
		yfull = (height >> 2) << 2;
		if (xfull > 0 && yfull > 0)
		{
			xover = width - xfull;
			yover = height - yfull;
		}
		/* If one direction is not of tile length, we must do everything per pixel */
		else
		{
			xfull = yfull = 0;
			xover = width;
			yover = height;
		}
		tile = 0;

