NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
		/* Iterate the full tiles */
		for (j = 0; j < yfull; j+=4)
		{
			for (i = 0; i < xfull; i+=4)
			{
				/* NEON is dropped due to instructions not working on 64-bit elements (vrev, vzip) */
				for (l = 0; l < 4; l++)
				{
					const u32 y = j + l;
					const u32 src_cur_row = y * src_pitch;

					for (k = 0; k < 4; k++)
					{
						const u32 x = i + k;
						/* As ETC uses 4x4 tiles instead of 16x16 tiles, we cannot use MALI_CONVERT_BLOCKED_ADDRESS */
						const u32 dst_offset = (tile * 4 * 4 + mali_convert_block_interleave_lut[l*16 + k]) * ETC_BLOCK_SIZE;
						/* Each ETC-element is 64bit; We do a memcpy */
						_mali_sys_memcpy(dst_ptr + dst_offset, src_ptr + src_cur_row + x * ETC_BLOCK_SIZE, ETC_BLOCK_SIZE);
					}
				}
				tile++;
			}
			if (xover)
			{
				tile++;
			}
		}
		if (xover)
		{
			for (j = 0; j < height; j++)
			{
				const u32 src_cur_row = j * src_pitch;

				for (i = xfull; i < width; i++)
				{
					const u32 dst_offset = (((j/4) * (MALI_ALIGN(width, 4)/4) + (i/4)) * 4 * 4 + mali_convert_block_interleave_lut[(j%4)*16 + (i%4)]) * ETC_BLOCK_SIZE;
					_mali_sys_memcpy(dst_ptr + dst_offset, src_ptr + src_cur_row + i * ETC_BLOCK_SIZE, ETC_BLOCK_SIZE);

				}
			}
		}
		if (yover)
		{
			for (j = yfull; j < height; j++)
			{
				const u32 src_cur_row = j * src_pitch;

				/* xfull to width, if existing, is covered by xover */
				for (i = 0; i < xfull; i++)
				{
					const u32 dst_offset = (((j/4) * (MALI_ALIGN(width, 4)/4) + (i/4)) * 4 * 4 + mali_convert_block_interleave_lut[(j%4)*16 + (i%4)]) * ETC_BLOCK_SIZE;
					_mali_sys_memcpy(dst_ptr + dst_offset, src_ptr + src_cur_row + i * ETC_BLOCK_SIZE, ETC_BLOCK_SIZE);
				}
			}
		}
#undef ETC_BLOCK_DIM
#undef ETC_TEXELS_PER_BYTE
#undef ETC_BLOCK_SIZE
		retval = MALI_TRUE;
		goto cleanup;
	}

	/* Handle the virtual formats */
	if ( (convert_request->src_format.texel_format == M200_TEXEL_FORMAT_VIRTUAL_DEPTH32 || 
	      convert_request->src_format.texel_format == M200_TEXEL_FORMAT_VIRTUAL_DEPTH16 ||
	      convert_request->src_format.texel_format == M200_TEXEL_FORMAT_VIRTUAL_STENCIL_DEPTH_8_24) &&
	     MALI_TRUE == do_swizzle )
	{
		/* TODO: the _partial functions are slow compared to the _full_width or _full_block functions! the following code is not optimal. 
		 *       See optimization bugzilla 10970 for details */
		switch (convert_request->src_format.texel_format)
		{
			case M200_TEXEL_FORMAT_VIRTUAL_DEPTH32:
				if (convert_request->dst_format.texel_format == M200_TEXEL_FORMAT_L_16)
				{
					if (MALI_FALSE == subarea)
					{
						_mali_convert_tex32_l_to_tex16_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
					}
					else
					{
						_tex32_l_to_tex16_b_partial(dst_ptr, src_ptr, &(convert_request->rect), src_pitch, dst_width_aligned);
					}

					retval = MALI_TRUE;
					goto cleanup;
				}
				break;
			case M200_TEXEL_FORMAT_VIRTUAL_DEPTH16:
				if (convert_request->dst_format.texel_format == M200_TEXEL_FORMAT_L_16)
				{
					if (MALI_FALSE == subarea)
					{
						_mali_convert_tex16_l_to_tex16_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
					}
					else
					{
						_tex16_l_to_tex16_b_partial(dst_ptr, src_ptr, &(convert_request->rect), src_pitch, dst_width_aligned);
					}

					retval = MALI_TRUE;
					goto cleanup;
				}
				break;
			case M200_TEXEL_FORMAT_VIRTUAL_STENCIL_DEPTH_8_24:
				if (convert_request->dst_format.texel_format == M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8)
				{
					if (MALI_FALSE == subarea)
					{
						_mali_convert_tex8_24_l_to_tex24_8_b(dst_ptr, src_ptr, dst_width, dst_height, src_pitch);
					}
					else
					{
						_tex8_24_l_to_tex24_8_b_partial(dst_ptr, src_ptr, &(convert_request->rect), src_pitch, dst_width_aligned);
					}

					retval = MALI_TRUE;
					goto cleanup;
				}
				break;
			default:
				break;
		}
	}

	/* CONVERSION */

	/* Check that conversion is supported */
	if (MALI_FALSE == _conversion_supported(convert_request) || MALI_TRUE == _conversion_not_color(convert_request))
	{
		/* TODO: support for remaining conversions */
		retval = MALI_FALSE;
		goto cleanup;
	}

	/* Set up conversion variables */
	conv_rules_nonpre = _mali_convert_setup_conversion_rules(&convert_request->src_format, &convert_request->dst_format);
	conv_rules_premult = ( dst_nonpre_ptr ? conv_rules_nonpre | MALI_CONVERT_DST_PREMULT : conv_rules_nonpre );

	/* If we do not have to do any conversion on the texels */
	pass_through = same_formats && !alpha_to_one;
	if (convert_request->source == MALI_CONVERT_SOURCE_OPENVG || convert_request->source == MALI_CONVERT_SOURCE_SHARED)
	{
		pass_through &= (conv_rules_nonpre == conv_rules_premult);
	}

	/* Calculate the number of full width / height blocks. */
	xfull = (width >> 4) << 4;
	yfull = (height >> 4) << 4;
	if (xfull > 0 && yfull > 0)
	{
		xover = width - xfull;
		yover = height - yfull;
	}
	/* If one direction is not of tile length, we must do everything per pixel */
	else
	{
		_mali_convert_texture_slowpath(
			convert_request,
			0, width, 0, height,
			src_bpp, dst_bpp,
			src_blocked,
			dst_blocked,
			conv_rules_nonpre,
			conv_rules_premult,
			pass_through,
			same_formats );
		retval = MALI_TRUE;
		goto cleanup;
	}
	tile = 0;

#if (MALI_PLATFORM_ARM_NEON)
	/* Do full tiles instead of pixels near the edges; Optimization only works for blocked->blocked because of their allocated areas. */
	if (MALI_TRUE == do_neon && MALI_TRUE == src_blocked && MALI_TRUE == dst_blocked)
	{
		xfull = MALI_ALIGN(width, 16);
		yfull = MALI_ALIGN(height, 16);
		xover = yover = 0;
	}
#else 
	MALI_IGNORE(do_neon);
#endif

	/* Iterate the full tiles */
	for (j = 0; j < yfull; j+=16)
	{
		for (i = 0; i < xfull; i+=16)
		{
			/* If NEON, can do entire tile */
#if (MALI_PLATFORM_ARM_NEON)
			if (MALI_TRUE == do_neon)
			{
				/* Fastpath: assembly swizzle for same formats */
				if (MALI_TRUE == same_formats && MALI_TRUE == do_swizzle && MALI_FALSE == store_nonpre_data)
				{
					src_address = (sy+j) * src_pitch + (sx+i) * src_bytespp;
					dst_address = tile * 16 * 16 * dst_bytespp;
					switch (src_bpp)
					{
						case 8:
							_mali_osu_tex8_l_to_tex8_b_full_block(dst_ptr + dst_address, src_ptr + src_address, src_pitch);
							break;
						case 16:
							_mali_osu_tex16_l_to_tex16_b_full_block(dst_ptr + dst_address, src_ptr + src_address, src_pitch);
							break;
						case 24:
							_mali_osu_tex24_l_to_tex24_b_full_block(dst_ptr + dst_address, src_ptr + src_address, src_pitch);
							break;
						case 32:
							_mali_osu_tex32_l_to_tex32_b_full_block(dst_ptr + dst_address, src_ptr + src_address, src_pitch);
							break;
						default:
							MALI_DEBUG_ASSERT(0, ("Not yet implemented"));
					}
					tile++;
					continue;
				}
				/* Fastpath: NEON intrinsics operations on 8x8 tiles.
				 * @note: The tiles are looped in a NW, NE, SE, SW pattern to support (de-)swizzling.
				 */
				else
				{
					u32 src_row_offset, dst_row_offset, src_tile_offset, dst_tile_offset;
					if (MALI_TRUE == src_blocked)
					{
						src_address = tile * 16 * 16 * src_bytespp;
						src_row_offset = 8 * src_bytespp;
						src_tile_offset = 8 * src_row_offset;
					}
					else
					{
						src_address = (sy+j) * src_pitch + (sx+i) * src_bytespp;
						src_row_offset = src_pitch;
						src_tile_offset = 8 * src_bytespp;
					}
					if (MALI_TRUE == dst_blocked)
					{
						dst_address = tile * 16 * 16 * dst_bytespp;
						dst_row_offset = 8 * dst_bytespp;
						dst_tile_offset = 8 * dst_row_offset;
					}
					else
					{
						dst_address = (dy+j) * dst_pitch + (dx+i) * dst_bytespp;
						dst_row_offset = dst_pitch;
						dst_tile_offset = 8 * dst_bytespp;
					}
					/* NW */
					_mali_convert_intrinsics_8x8_tile(
						(u8*)src_ptr+src_address,
						src_row_offset,
						src_surfspec,
						(u8*)dst_ptr+dst_address,
						(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
						dst_row_offset,
						dst_surfspec,
						convert_request->source,
						conv_rules_premult,
						do_swizzle,
						do_deswizzle );
					/* NE */
					src_address += src_tile_offset;
					dst_address += dst_tile_offset;
					_mali_convert_intrinsics_8x8_tile(
						(u8*)src_ptr+src_address,
						src_row_offset,
						src_surfspec,
						(u8*)dst_ptr+dst_address,
						(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
						dst_row_offset,
						dst_surfspec,
						convert_request->source,
						conv_rules_premult,
						do_swizzle,
						do_deswizzle );
					/* SE */
					src_address += 8 * src_row_offset;
					dst_address += 8 * dst_row_offset;
					_mali_convert_intrinsics_8x8_tile(
						(u8*)src_ptr+src_address,
						src_row_offset,
						src_surfspec,
						(u8*)dst_ptr+dst_address,
						(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
						dst_row_offset,
						dst_surfspec,
						convert_request->source,
						conv_rules_premult,
						do_swizzle,
						do_deswizzle );
					/* SW */
					if (MALI_TRUE == src_blocked)
					{
						src_address += src_tile_offset;
					}
					else
					{
						src_address -= src_tile_offset;
					}
					if (MALI_TRUE == dst_blocked)
					{
						dst_address += dst_tile_offset;
					}
					else
					{
						dst_address -= dst_tile_offset;
					}
					_mali_convert_intrinsics_8x8_tile(
						(u8*)src_ptr+src_address,
						src_row_offset,
						src_surfspec,
						(u8*)dst_ptr+dst_address,
						(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
						dst_row_offset,
						dst_surfspec,
						convert_request->source,
						conv_rules_premult,
						do_swizzle,
						do_deswizzle );
					tile++;
					continue;
				}
			}
#endif /* (MALI_PLATFORM_ARM_NEON) */

			/* Slowpath: if no NEON, have to loop the texels */
			_mali_convert_texture_slowpath(
				convert_request,
				i, i + 16, j, j + 16,
				src_bpp, dst_bpp,
				src_blocked,
				dst_blocked,
				conv_rules_nonpre,
				conv_rules_premult,
				pass_through,
				same_formats );
		}
#if (MALI_PLATFORM_ARM_NEON)
		/* Special offset rules for interleaved textures near the width-edge.
		 * @note All interleaved textures have allocated space equal to a multiple of tiles.
		 */
		/* If we are swizzling a subarea, we have to offset the dst_address accordingly. */
		if (MALI_TRUE == do_swizzle && dst_width > width)
		{
			tile += (dst_width - width)/16;
		}
		/* If we are deswizzling a subarea, we have to offset the src_address accordingly. */
		if (MALI_TRUE == do_deswizzle && src_width > width)
		{
			tile += (src_width - width)/16;
		}
		/* If the conversion rectangle is not a multiple of tiles, we have to offset all interleaved addresses by one tile */
		if (xover)
		{
			tile++;
		}
#endif /* (MALI_PLATFORM_ARM_NEON) */
	}

	/* Do non-full tiles per texel instead of per tile */
	if (xover)
	{
#if (MALI_PLATFORM_ARM_NEON)
		/* Do NEON conversion on 8x8 blocks in non-tiled edges if possible */
		if (MALI_TRUE == do_neon && xover >= 8 && _neon_conversion_supported(convert_request))
		{
			for (j = 0; j < (height & ~0x07); j += 8)
			{
				u32 src_row_offset, dst_row_offset;
				if (MALI_TRUE == src_blocked)
				{
					src_row_offset = 8 * src_bytespp;
					src_address = ((j & ~0x0F) * src_width_aligned + xfull * 16 + 3 * (j & 0x08) * 8) * src_bytespp;
				}
				else
				{
					src_row_offset = src_pitch;
					src_address = (sy+j) * src_pitch + (sx+xfull) * src_bytespp;
				}
				if (MALI_TRUE == dst_blocked)
				{
					dst_row_offset = 8 * dst_bytespp;
					dst_address = ((j & ~0x0F) * dst_width_aligned + xfull * 16 + 3 * (j & 0x08) * 8) * dst_bytespp;
				}
				else
				{
					dst_row_offset = dst_pitch;
					dst_address = (dy+j) * dst_pitch + (dx+xfull) * dst_bytespp;
				}

