NexellCorp/android_hal_pyrope/ogl_4330/src/shared/convert/m200_texture_convert.c
				_mali_convert_intrinsics_8x8_tile(
					(u8*)src_ptr+src_address,
					src_row_offset,
					src_surfspec,
					(u8*)dst_ptr+dst_address,
					(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
					dst_row_offset,
					dst_surfspec,
					convert_request->source,
					conv_rules_premult,
					do_swizzle,
					do_deswizzle );
			}
			xfull += 8;
		}
#endif /* (MALI_PLATFORM_ARM_NEON) */
		_mali_convert_texture_slowpath(
			convert_request,
			xfull, width, 0, height,
			src_bpp, dst_bpp,
			src_blocked,
			dst_blocked,
			conv_rules_nonpre,
			conv_rules_premult,
			pass_through,
			same_formats );
	}
	if (yover)
	{
#if (MALI_PLATFORM_ARM_NEON)
		/* Do NEON conversion on 8x8 blocks in non-tiled edges if possible */
		if (MALI_TRUE == do_neon && yover >= 8 && _neon_conversion_supported(convert_request))
		{
			for (i = 0; i < xfull; i += 8)
			{
				u32 src_row_offset, dst_row_offset;
				if (MALI_TRUE == src_blocked)
				{
					src_row_offset = 8 * src_bytespp;
					src_address = (yfull * src_width_aligned + (i & ~0x0F) * 16 + (i & 0x8) * 8) * src_bytespp;
				}
				else
				{
					src_row_offset = src_pitch;
					src_address = (sy+yfull) * src_pitch + (sx+i) * src_bytespp;
				}
				if (MALI_TRUE == dst_blocked)
				{
					dst_row_offset = 8 * dst_bytespp;
					dst_address = (yfull * dst_width_aligned + (i & ~0x0F) * 16 + (i & 0x8) * 8) * dst_bytespp;
				}
				else
				{
					dst_row_offset = dst_pitch;
					dst_address = (dy+yfull) * dst_pitch + (dx+i) * dst_bytespp;
				}

				_mali_convert_intrinsics_8x8_tile(
					(u8*)src_ptr+src_address,
					src_row_offset,
					src_surfspec,
					(u8*)dst_ptr+dst_address,
					(store_nonpre_data ? dst_nonpre_ptr + dst_address : NULL),
					dst_row_offset,
					dst_surfspec,
					convert_request->source,
					conv_rules_premult,
					do_swizzle,
					do_deswizzle );
			}
			yfull += 8;
		}
#endif /* (MALI_PLATFORM_ARM_NEON) */
		/* xfull to width, if existing, is covered by xover */
		_mali_convert_texture_slowpath(
			convert_request,
			0, xfull, yfull, height,
			src_bpp, dst_bpp,
			src_blocked,
			dst_blocked,
			conv_rules_nonpre,
			conv_rules_premult,
			pass_through,
			same_formats );
	}

	retval = MALI_TRUE;

cleanup:

#if MALI_BIG_ENDIAN
	/* On big endian platforms the source data always cpu mem. If destination is mali_mem we need to swap back */
	if (MALI_TRUE == convert_request->dst_is_malimem)
	{
		for (j = 0; j < dy; j++)
		{
			s32 offset = dst_pitch * j + dx * dst_bytespp;
			_mali_byteorder_swap_endian(dst_ptr + offset, width * dst_bytespp, dst_bytespp);
		}
	}
	if (NULL != cpu_ptr)
	{
		_mali_sys_free(cpu_ptr);
	}
#endif

	return retval;
#undef IS_UNALIGNED
}

#endif  /* !__SYMBIAN32__ || SYMBIAN_LIB_MALI_BASE */
